theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the ZCE13 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE13(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE13_MASK, ADC_ZXCTRL2_ZCE13(value)))
#define ADC_BWR_ZXCTRL2_ZCE13(base, value) (ADC_WR_ZXCTRL2_ZCE13(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE14[13:12] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE14 field. */
#define ADC_RD_ZXCTRL2_ZCE14(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE14_MASK) >> ADC_ZXCTRL2_ZCE14_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE14(base) (ADC_RD_ZXCTRL2_ZCE14(base))

/*! @brief Set the ZCE14 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE14(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE14_MASK, ADC_ZXCTRL2_ZCE14(value)))
#define ADC_BWR_ZXCTRL2_ZCE14(base, value) (ADC_WR_ZXCTRL2_ZCE14(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE15[15:14] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE15 field. */
#define ADC_RD_ZXCTRL2_ZCE15(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE15_MASK) >> ADC_ZXCTRL2_ZCE15_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE15(base) (ADC_RD_ZXCTRL2_ZCE15(base))

/*! @brief Set the ZCE15 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE15(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE15_MASK, ADC_ZXCTRL2_ZCE15(value)))
#define ADC_BWR_ZXCTRL2_ZCE15(base, value) (ADC_WR_ZXCTRL2_ZCE15(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CLIST1 - ADC Channel List Register 1
 ******************************************************************************/

/*!
 * @brief ADC_CLIST1 - ADC Channel List Register 1 (RW)
 *
 * Reset value: 0x3210U
 */
/*!
 * @name Constants and macros for entire ADC_CLIST1 register
 */
/*@{*/
#define ADC_RD_CLIST1(base)      (ADC_CLIST1_REG(base))
#define ADC_WR_CLIST1(base, value) (ADC_CLIST1_REG(base) = (value))
#define ADC_RMW_CLIST1(base, mask, value) (ADC_WR_CLIST1(base, (ADC_RD_CLIST1(base) & ~(mask)) | (value)))
#define ADC_SET_CLIST1(base, value) (ADC_WR_CLIST1(base, ADC_RD_CLIST1(base) |  (value)))
#define ADC_CLR_CLIST1(base, value) (ADC_WR_CLIST1(base, ADC_RD_CLIST1(base) & ~(value)))
#define ADC_TOG_CLIST1(base, value) (ADC_WR_CLIST1(base, ADC_RD_CLIST1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CLIST1 bitfields
 */

/*!
 * @name Register ADC_CLIST1, field SAMPLE0[3:0] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST1_SAMPLE0 field. */
#define ADC_RD_CLIST1_SAMPLE0(base) ((ADC_CLIST1_REG(base) & ADC_CLIST1_SAMPLE0_MASK) >> ADC_CLIST1_SAMPLE0_SHIFT)
#define ADC_BRD_CLIST1_SAMPLE0(base) (ADC_RD_CLIST1_SAMPLE0(base))

/*! @brief Set the SAMPLE0 field to a new value. */
#define ADC_WR_CLIST1_SAMPLE0(base, value) (ADC_RMW_CLIST1(base, ADC_CLIST1_SAMPLE0_MASK, ADC_CLIST1_SAMPLE0(value)))
#define ADC_BWR_CLIST1_SAMPLE0(base, value) (ADC_WR_CLIST1_SAMPLE0(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST1, field SAMPLE1[7:4] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST1_SAMPLE1 field. */
#define ADC_RD_CLIST1_SAMPLE1(base) ((ADC_CLIST1_REG(base) & ADC_CLIST1_SAMPLE1_MASK) >> ADC_CLIST1_SAMPLE1_SHIFT)
#define ADC_BRD_CLIST1_SAMPLE1(base) (ADC_RD_CLIST1_SAMPLE1(base))

/*! @brief Set the SAMPLE1 field to a new value. */
#define ADC_WR_CLIST1_SAMPLE1(base, value) (ADC_RMW_CLIST1(base, ADC_CLIST1_SAMPLE1_MASK, ADC_CLIST1_SAMPLE1(value)))
#define ADC_BWR_CLIST1_SAMPLE1(base, value) (ADC_WR_CLIST1_SAMPLE1(base, value))
/*@}*/

/*!
 * @name Register ADC_CLIST1, field SAMPLE2[11:8] (RW)
 *
 * Values:
 * - 0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the ADC_CLIST1_SAMPLE2 field. */
#define ADC_RD_CLIST1_SAMPLE2(base) ((ADC_CLIST1_REG(base) & ADC_CLIST1_SAMPLE2_MASK) >> ADC_CLIST1_SAMPLE2_SHIFT)
#define ADC_BRD_CLIST1_SAMPLE2(base) (ADC_RD_CLIST1_SAMPLE2(base))

