theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * ADC_OFFST - ADC Offset Registers
 ******************************************************************************/

/*!
 * @brief ADC_OFFST - ADC Offset Registers (RW)
 *
 * Reset value: 0x0000U
 *
 * The value of the offset register is used to correct the ADC result before it
 * is stored in the RSLT registers. The offset value is subtracted from the ADC
 * result. To obtain unsigned results, program the respective offset register with
 * a value of $0000, thus giving a result range of $0000 to $7FF8.
 */
/*!
 * @name Constants and macros for entire ADC_OFFST register
 */
/*@{*/
#define ADC_RD_OFFST(base, index) (ADC_OFFST_REG(base, index))
#define ADC_WR_OFFST(base, index, value) (ADC_OFFST_REG(base, index) = (value))
#define ADC_RMW_OFFST(base, index, mask, value) (ADC_WR_OFFST(base, index, (ADC_RD_OFFST(base, index) & ~(mask)) | (value)))
#define ADC_SET_OFFST(base, index, value) (ADC_WR_OFFST(base, index, ADC_RD_OFFST(base, index) |  (value)))
#define ADC_CLR_OFFST(base, index, value) (ADC_WR_OFFST(base, index, ADC_RD_OFFST(base, index) & ~(value)))
#define ADC_TOG_OFFST(base, index, value) (ADC_WR_OFFST(base, index, ADC_RD_OFFST(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_OFFST bitfields
 */

/*!
 * @name Register ADC_OFFST, field OFFSET[14:3] (RW)
 */
/*@{*/
/*! @brief Read current value of the ADC_OFFST_OFFSET field. */
#define ADC_RD_OFFST_OFFSET(base, index) ((ADC_OFFST_REG(base, index) & ADC_OFFST_OFFSET_MASK) >> ADC_OFFST_OFFSET_SHIFT)
#define ADC_BRD_OFFST_OFFSET(base, index) (ADC_RD_OFFST_OFFSET(base, index))

/*! @brief Set the OFFSET field to a new value. */
#define ADC_WR_OFFST_OFFSET(base, index, value) (ADC_RMW_OFFST(base, index, ADC_OFFST_OFFSET_MASK, ADC_OFFST_OFFSET(value)))
#define ADC_BWR_OFFST_OFFSET(base, index, value) (ADC_WR_OFFST_OFFSET(base, index, value))
/*@}*/

/*******************************************************************************
 * ADC_PWR - ADC Power Control Register
 ******************************************************************************/

/*!
 * @brief ADC_PWR - ADC Power Control Register (RW)
 *
 * Reset value: 0x1DA7U
 *
 * This register controls the power management features of the ADC module. There
 * are individual manual power down controls for the two ADC converters and the
 * voltage reference generators. There are also five distinct power modes. The
 * following terms are used to describe power modes and their related controls.
 * Power down state Each converter and voltage reference generator can individually
 * be put into a power down state. When powered down, the unit consumes no power.
 * Results of scans referencing a powered down converter are undefined. At least
 * one converter must be powered up to use the ADC module. Manual power down
 * controls Each converter and voltage reference generator have a manual power
 * control bit capable of putting that component into the power down state. Converters
 * have other mechanisms that can automatically put them into the power down
 * state. Idle state The ADC module is idle when neither of the two converters has a
 * scan in process. Active state The ADC module is active when at least one of
 * the two converters has a scan in process. Current Mode Both converters share a
 * common current mode. Normal current mode is used to power the converters at
 * clock rates above 600kHz. Current mode does not affect the number of ADC clock
 * cycles required to do a conversion or the accuracy of a conversion. The ADC
 * module may change the current mode when idle as part of the power saving
 * strategy. Startup delay Auto-powerdown and auto-standby power modes cause a startup
 * delay when the ADC module goes between the idle and active states to allow time
 * to switch clocks or power configurations.
 */
/*!
 * @name Constants and macros for entire ADC_PWR register
 */
/*@{*/
#define ADC_RD_PWR(base)         (ADC_PWR_REG(base))
#define ADC_WR_PWR(base, value)  (ADC_PWR_REG(base) = (value))
#define ADC_RMW_PWR(base, mask, value) (ADC_WR_PWR(base, (ADC_RD_PWR(base) & ~(mask)) | (value)))
#define ADC_SET_PWR(base, value) (ADC_WR_PWR(base, ADC_RD_PWR(base) |  (value)))
#define ADC_CLR_PWR(base, value) (ADC_WR_PWR(base, ADC_RD_PWR(base) & ~(value)))
#define ADC_TOG_PWR(base, value) (ADC_WR_PWR(base, ADC_RD_PWR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_PWR bitfields
 */

/*!
 * @name Register ADC_PWR, field PD0[0] (RW)
 *
 * This bit forces ADC converter A to power down. Asserting this bit powers down
 * converter A immediately. The results of a scan using converter A will be
 * invalid while PWR[PD0] is asserted. When PWR[PD0] is cleared, converter A is
 * either continuously powered up (PWR[APD] = 0) or automatically powered up when
 * needed (PWR[APD]=1). When clearing this bit in any power mode except
 * auto-powerdown (PWR[APD]=1), wait PWR[PUDELAY] ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. The PWR[PSTS0] bit can be polled
 * to determine when the PWR[PUDELAY] time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the first two samples.
 *
 * Values:
 * - 0 - Power Up ADC converter A
 * - 1 - Power Down ADC converter A
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_PD0 field. */
#define ADC_RD_PWR_PD0(base) ((ADC_PWR_REG(base) & ADC_PWR_PD0_MASK) >> ADC_PWR_PD0_SHIFT)
#define ADC_BRD_PWR_PD0(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PD0_SHIFT))

/*! @brief Set the PD0 field to a new value. */
#define ADC_WR_PWR_PD0(base, value) (ADC_RMW_PWR(base, ADC_PWR_PD0_MASK, ADC_PWR_PD0(value)))
#define ADC_BWR_PWR_PD0(base, value) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PD0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PWR, field PD1[1] (RW)
 *
 * This bit forces ADC converter B to power down. Asserting this bit powers down
 * converter B immediately. The results of a scan using converter B will be
 * invalid while PWR[PD1] is asserted. When PWR[PD1] is cleared, converter B is
 * either continuously powered up (PWR[APD] = 0) or automatically powered up when
 * needed (PWR[APD]=1). When clearing this bit in any power mode except
 * auto-powerdown (PWR[APD]=1), wait PWR[PUDELAY] ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. The PWR[PSTS1] bit can be polled
 * to determine when the PWR[PUDELAY] time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the first two samples.
 *
 * Values:
 * - 0 - Power Up ADC converter B
 * - 1 - Power Down ADC converter B
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_PD1 field. */
#define ADC_RD_PWR_PD1(base) ((ADC_PWR_REG(base) & ADC_PWR_PD1_MASK) >> ADC_PWR_PD1_SHIFT)
#define ADC_BRD_PWR_PD1(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PD1_SHIFT))

/*! @brief Set the PD1 field to a new value. */
#define ADC_WR_PWR_PD1(base, value) (ADC_RMW_PWR(base, ADC_PWR_PD1_MASK, ADC_PWR_PD1(value)))
#define ADC_BWR_PWR_PD1(base, value) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PD1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PWR, field APD[3] (RW)
 *
 * Auto-powerdown mode powers down converters when not in use for a scan.
 * PWR[APD] takes precedence over PWR[ASB]. When a scan is started in PWR[APD] mode, a
 * delay of PWR[PUDELAY] ADC clock cycles is imposed during which the needed
 * converter(s), if idle, are powered up. The ADC will then initiate a scan
 * equivalent to that done when PWR[APD] is not active. When the scan is completed, the
 * converter(s) are powered down again. If PWR[ASB or APD] is asserted while a scan
 * is in progress, that scan is unaffected and the ADC will wait to enter its
 * low power state until after all conversions are complete and both ADCs are idle.
 * PWR[ASB and APD] are not useful in looping modes. The continuous nature of
 * scanning means that the low power state can never be entered.
 *
 * Values:
 * - 0 - Auto Powerdown Mode is not active
 * - 1 - Auto Powerdown Mode is active
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_APD field. */
#define ADC_RD_PWR_APD(base) ((ADC_PWR_REG(base) & ADC_PWR_APD_MASK) >> ADC_PWR_APD_SHIFT)
#define ADC_BRD_PWR_APD(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_APD_SHIFT))

/*! @brief Set the APD field to a new value. */
#define ADC_WR_PWR_APD(base, value) (ADC_RMW_PWR(base, ADC_PWR_APD_MASK, ADC_PWR_APD(value)))
#define ADC_BWR_PWR_APD(base, value) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_APD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_PWR, field PUDELAY[9:4] (RW)
 *
 * This 6-bit field determines the number of ADC clocks provided to power up an
 * ADC converter (after setting PWR[PD0 or PD1] to 0) before allowing a scan to
 * start. It also determines the number of ADC clocks of delay provided in
 * auto-powerdown (APD) and auto-standby (ASB) modes between when the ADC goes from the
 * idle to active state and when the scan is allowed to start. The default value
 * is 26 ADC clocks. Accuracy of the initial conversions in a scan will be
 * degraded if PWR[PUDELAY] is set to too small a value. PWR[PUDELAY] defaults to a
 * value that is typically sufficient for any power mode. The latency of a scan can
 * be reduced by reducing PWR[PUDELAY] to the lowest value for which accuracy is
 * not degraded. Refer to the data sheet for further details.
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_PUDELAY field. */
#define ADC_RD_PWR_PUDELAY(base) ((ADC_PWR_REG(base) & ADC_PWR_PUDELAY_MASK) >> ADC_PWR_PUDELAY_SHIFT)
#define ADC_BRD_PWR_PUDELAY(base) (ADC_RD_PWR_PUDELAY(base))

/*! @brief Set the PUDELAY field to a new value. */
#define ADC_WR_PWR_PUDELAY(base, value) (ADC_RMW_PWR(base, ADC_PWR_PUDELAY_MASK, ADC_PWR_PUDELAY(value)))
#define ADC_BWR_PWR_PUDELAY(base, value) (ADC_WR_PWR_PUDELAY(base, value))
/*@}*/

/*!
 * @name Register ADC_PWR, field PSTS0[10] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PD0]. It is
 * de-asserted PWR[PUDELAY] ADC clock cycles after a write of "0" to PWR[PD0] if
 * PWR[APD] is "0". This bit can be read as a status bit to determine when the
 * ADC is ready for operation. During auto-powerdown mode, this bit indicates the
 * current powered state of converter A.
 *
 * Values:
 * - 0 - ADC Converter A is currently powered up
 * - 1 - ADC Converter A is currently powered down
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_PSTS0 field. */
#define ADC_RD_PWR_PSTS0(base) ((ADC_PWR_REG(base) & ADC_PWR_PSTS0_MASK) >> ADC_PWR_PSTS0_SHIFT)
#define ADC_BRD_PWR_PSTS0(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PSTS0_SHIFT))
/*@}*/

/*!
 * @name Register ADC_PWR, field PSTS1[11] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PD1]. It is
 * de-asserted PWR[PUDELAY] ADC clock cycles after a write of "0" to PWR[PD1] if
 * PWR[APD] is "0". This bit can be read as a status bit to determine when the
 * ADC is ready for operation. During auto-powerdown mode, this bit indicates the
 * current powered state of converter B.
 *
 * Values:
 * - 0 - ADC Converter B is currently powered up
 * - 1 - ADC Converter B is currently powered down
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_PSTS1 field. */
#define ADC_RD_PWR_PSTS1(base) ((ADC_PWR_REG(base) & ADC_PWR_PSTS1_MASK) >> ADC_PWR_PSTS1_SHIFT)
#define ADC_BRD_PWR_PSTS1(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_PSTS1_SHIFT))
/*@}*/

/*!
 * @name Register ADC_PWR, field ASB[15] (RW)
 *
 * This bit selects auto-standby mode. PWR[ASB] is ignored if PWR[APD] is 1.
 * When the ADC is idle, auto-standby mode selects the standby clock as the ADC
 * clock source and puts the converters into standby current mode. At the start of
 * any scan, the conversion clock is selected as the ADC clock and then a delay of
 * PWR[PUDELAY] ADC clock cycles is imposed for current levels to stabilize.
 * After this delay, the ADC will initiate the scan. When the ADC returns to the idle
 * state, the standby clock is again selected and the converters revert to the
 * standby current state. This mode is not recommended for conversion clock rates
 * at or below 100kHz. Instead, set PWR[ASB and APD]=0 and use standby power mode
 * (normal mode with a sufficiently slow conversion clock so that standby
 * current mode automatically engages). This provides the advantages of standby current
 * mode while avoiding the clock switching and the PWR[PUDELAY]. Set PWR[ASB]
 * prior to clearning PWR[PD1/0].
 *
 * Values:
 * - 0 - Auto standby mode disabled
 * - 1 - Auto standby mode enabled
 */
/*@{*/
/*! @brief Read current value of the ADC_PWR_ASB field. */
#define ADC_RD_PWR_ASB(base) ((ADC_PWR_REG(base) & ADC_PWR_ASB_MASK) >> ADC_PWR_ASB_SHIFT)
#define ADC_BRD_PWR_ASB(base) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_ASB_SHIFT))

/*! @brief Set the ASB field to a new value. */
#define ADC_WR_PWR_ASB(base, value) (ADC_RMW_PWR(base, ADC_PWR_ASB_MASK, ADC_PWR_ASB(value)))
#define ADC_BWR_PWR_ASB(base, value) (BITBAND_ACCESS16(&ADC_PWR_REG(base), ADC_PWR_ASB_SHIFT) = (value))
/*@}*/

