theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * CAN_CS - Message Buffer 0 CS Register
 ******************************************************************************/

/*!
 * @brief CAN_CS - Message Buffer 0 CS Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_CS register
 */
/*@{*/
#define CAN_RD_CS(base, index)   (CAN_CS_REG(base, index))
#define CAN_WR_CS(base, index, value) (CAN_CS_REG(base, index) = (value))
#define CAN_RMW_CS(base, index, mask, value) (CAN_WR_CS(base, index, (CAN_RD_CS(base, index) & ~(mask)) | (value)))
#define CAN_SET_CS(base, index, value) (CAN_WR_CS(base, index, CAN_RD_CS(base, index) |  (value)))
#define CAN_CLR_CS(base, index, value) (CAN_WR_CS(base, index, CAN_RD_CS(base, index) & ~(value)))
#define CAN_TOG_CS(base, index, value) (CAN_WR_CS(base, index, CAN_RD_CS(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual CAN_CS bitfields
 */

/*!
 * @name Register CAN_CS, field TIME_STAMP[15:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_TIME_STAMP field. */
#define CAN_RD_CS_TIME_STAMP(base, index) ((CAN_CS_REG(base, index) & CAN_CS_TIME_STAMP_MASK) >> CAN_CS_TIME_STAMP_SHIFT)
#define CAN_BRD_CS_TIME_STAMP(base, index) (CAN_RD_CS_TIME_STAMP(base, index))

/*! @brief Set the TIME_STAMP field to a new value. */
#define CAN_WR_CS_TIME_STAMP(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_TIME_STAMP_MASK, CAN_CS_TIME_STAMP(value)))
#define CAN_BWR_CS_TIME_STAMP(base, index, value) (CAN_WR_CS_TIME_STAMP(base, index, value))
/*@}*/

/*!
 * @name Register CAN_CS, field DLC[19:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_DLC field. */
#define CAN_RD_CS_DLC(base, index) ((CAN_CS_REG(base, index) & CAN_CS_DLC_MASK) >> CAN_CS_DLC_SHIFT)
#define CAN_BRD_CS_DLC(base, index) (CAN_RD_CS_DLC(base, index))

/*! @brief Set the DLC field to a new value. */
#define CAN_WR_CS_DLC(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_DLC_MASK, CAN_CS_DLC(value)))
#define CAN_BWR_CS_DLC(base, index, value) (CAN_WR_CS_DLC(base, index, value))
/*@}*/

/*!
 * @name Register CAN_CS, field RTR[20] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_RTR field. */
#define CAN_RD_CS_RTR(base, index) ((CAN_CS_REG(base, index) & CAN_CS_RTR_MASK) >> CAN_CS_RTR_SHIFT)
#define CAN_BRD_CS_RTR(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_RTR_SHIFT))

/*! @brief Set the RTR field to a new value. */
#define CAN_WR_CS_RTR(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_RTR_MASK, CAN_CS_RTR(value)))
#define CAN_BWR_CS_RTR(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_RTR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CS, field IDE[21] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_IDE field. */
#define CAN_RD_CS_IDE(base, index) ((CAN_CS_REG(base, index) & CAN_CS_IDE_MASK) >> CAN_CS_IDE_SHIFT)
#define CAN_BRD_CS_IDE(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_IDE_SHIFT))

/*! @brief Set the IDE field to a new value. */
#define CAN_WR_CS_IDE(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_IDE_MASK, CAN_CS_IDE(value)))
#define CAN_BWR_CS_IDE(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_IDE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CS, field SRR[22] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_SRR field. */
#define CAN_RD_CS_SRR(base, index) ((CAN_CS_REG(base, index) & CAN_CS_SRR_MASK) >> CAN_CS_SRR_SHIFT)
#define CAN_BRD_CS_SRR(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_SRR_SHIFT))

/*! @brief Set the SRR field to a new value. */
#define CAN_WR_CS_SRR(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_SRR_MASK, CAN_CS_SRR(value)))
#define CAN_BWR_CS_SRR(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_SRR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CS, field CODE[27:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_CODE field. */
#define CAN_RD_CS_CODE(base, index) ((CAN_CS_REG(base, index) & CAN_CS_CODE_MASK) >> CAN_CS_CODE_SHIFT)
#define CAN_BRD_CS_CODE(base, index) (CAN_RD_CS_CODE(base, index))

/*! @brief Set the CODE field to a new value. */
#define CAN_WR_CS_CODE(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_CODE_MASK, CAN_CS_CODE(value)))
#define CAN_BWR_CS_CODE(base, index, value) (CAN_WR_CS_CODE(base, index, value))
/*@}*/

/*!
 * @name Register CAN_CS, field ESI[29] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_ESI field. */
#define CAN_RD_CS_ESI(base, index) ((CAN_CS_REG(base, index) & CAN_CS_ESI_MASK) >> CAN_CS_ESI_SHIFT)
#define CAN_BRD_CS_ESI(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_ESI_SHIFT))

/*! @brief Set the ESI field to a new value. */
#define CAN_WR_CS_ESI(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_ESI_MASK, CAN_CS_ESI(value)))
#define CAN_BWR_CS_ESI(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_ESI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CS, field BRS[30] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_BRS field. */
#define CAN_RD_CS_BRS(base, index) ((CAN_CS_REG(base, index) & CAN_CS_BRS_MASK) >> CAN_CS_BRS_SHIFT)
#define CAN_BRD_CS_BRS(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_BRS_SHIFT))

/*! @brief Set the BRS field to a new value. */
#define CAN_WR_CS_BRS(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_BRS_MASK, CAN_CS_BRS(value)))
#define CAN_BWR_CS_BRS(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_BRS_SHIFT) = (value))
/*@}*/

/*!
 * @name Register CAN_CS, field EDL[31] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_EDL field. */
#define CAN_RD_CS_EDL(base, index) ((CAN_CS_REG(base, index) & CAN_CS_EDL_MASK) >> CAN_CS_EDL_SHIFT)
#define CAN_BRD_CS_EDL(base, index) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_EDL_SHIFT))

/*! @brief Set the EDL field to a new value. */
#define CAN_WR_CS_EDL(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_EDL_MASK, CAN_CS_EDL(value)))
#define CAN_BWR_CS_EDL(base, index, value) (BITBAND_ACCESS32(&CAN_CS_REG(base, index), CAN_CS_EDL_SHIFT) = (value))
/*@}*/

