theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * ENC_LINIT - Lower Initialization Register
 ******************************************************************************/

/*!
 * @brief ENC_LINIT - Lower Initialization Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_LINIT register
 */
/*@{*/
#define ENC_RD_LINIT(base)       (ENC_LINIT_REG(base))
#define ENC_WR_LINIT(base, value) (ENC_LINIT_REG(base) = (value))
#define ENC_RMW_LINIT(base, mask, value) (ENC_WR_LINIT(base, (ENC_RD_LINIT(base) & ~(mask)) | (value)))
#define ENC_SET_LINIT(base, value) (ENC_WR_LINIT(base, ENC_RD_LINIT(base) |  (value)))
#define ENC_CLR_LINIT(base, value) (ENC_WR_LINIT(base, ENC_RD_LINIT(base) & ~(value)))
#define ENC_TOG_LINIT(base, value) (ENC_WR_LINIT(base, ENC_RD_LINIT(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENC_IMR - Input Monitor Register
 ******************************************************************************/

/*!
 * @brief ENC_IMR - Input Monitor Register (RO)
 *
 * Reset value: 0x0000U
 *
 * This read-only register contains the values of the raw and filtered PHASEA,
 * PHASEB, INDEX, and HOME input signals. The reset value depends on the values of
 * the raw and filtered values of PHASEA, PHASEB, INDEX, and HOME. If these
 * input pins are connected to a pull-up, bits 0-7 of the IMR are all ones. If these
 * input pins are connected to a pull-down device, bits 0-7 are all zeros.
 */
/*!
 * @name Constants and macros for entire ENC_IMR register
 */
/*@{*/
#define ENC_RD_IMR(base)         (ENC_IMR_REG(base))
/*@}*/

/*
 * Constants & macros for individual ENC_IMR bitfields
 */

/*!
 * @name Register ENC_IMR, field HOME[0] (RO)
 *
 * This is the raw HOME input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_HOME field. */
#define ENC_RD_IMR_HOME(base) ((ENC_IMR_REG(base) & ENC_IMR_HOME_MASK) >> ENC_IMR_HOME_SHIFT)
#define ENC_BRD_IMR_HOME(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_HOME_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field INDEX[1] (RO)
 *
 * This is the raw INDEX input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_INDEX field. */
#define ENC_RD_IMR_INDEX(base) ((ENC_IMR_REG(base) & ENC_IMR_INDEX_MASK) >> ENC_IMR_INDEX_SHIFT)
#define ENC_BRD_IMR_INDEX(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_INDEX_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field PHB[2] (RO)
 *
 * This is the raw PHASEB input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_PHB field. */
#define ENC_RD_IMR_PHB(base) ((ENC_IMR_REG(base) & ENC_IMR_PHB_MASK) >> ENC_IMR_PHB_SHIFT)
#define ENC_BRD_IMR_PHB(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_PHB_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field PHA[3] (RO)
 *
 * This is the raw PHASEA input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_PHA field. */
#define ENC_RD_IMR_PHA(base) ((ENC_IMR_REG(base) & ENC_IMR_PHA_MASK) >> ENC_IMR_PHA_SHIFT)
#define ENC_BRD_IMR_PHA(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_PHA_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field FHOM[4] (RO)
 *
 * This is the filtered version of HOME input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_FHOM field. */
#define ENC_RD_IMR_FHOM(base) ((ENC_IMR_REG(base) & ENC_IMR_FHOM_MASK) >> ENC_IMR_FHOM_SHIFT)
#define ENC_BRD_IMR_FHOM(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_FHOM_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field FIND[5] (RO)
 *
 * This is the filtered version of INDEX input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_FIND field. */
#define ENC_RD_IMR_FIND(base) ((ENC_IMR_REG(base) & ENC_IMR_FIND_MASK) >> ENC_IMR_FIND_SHIFT)
#define ENC_BRD_IMR_FIND(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_FIND_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field FPHB[6] (RO)
 *
 * This is the filtered version of PHASEB input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_FPHB field. */
#define ENC_RD_IMR_FPHB(base) ((ENC_IMR_REG(base) & ENC_IMR_FPHB_MASK) >> ENC_IMR_FPHB_SHIFT)
#define ENC_BRD_IMR_FPHB(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_FPHB_SHIFT))
/*@}*/

/*!
 * @name Register ENC_IMR, field FPHA[7] (RO)
 *
 * This is the filtered version of PHASEA input.
 */
/*@{*/
/*! @brief Read current value of the ENC_IMR_FPHA field. */
#define ENC_RD_IMR_FPHA(base) ((ENC_IMR_REG(base) & ENC_IMR_FPHA_MASK) >> ENC_IMR_FPHA_SHIFT)
#define ENC_BRD_IMR_FPHA(base) (BITBAND_ACCESS16(&ENC_IMR_REG(base), ENC_IMR_FPHA_SHIFT))
/*@}*/

/*******************************************************************************
 * ENC_TST - Test Register
 ******************************************************************************/

/*!
 * @brief ENC_TST - Test Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This read/write register controls and sets the frequency of a quadrature
 * signal generator. It provides a quadrature test signal to the inputs of the
 * quadrature decoder module. The TEST_COUNT value is counted down to zero when the
 * test module is enabled (TEN = 1) and the count is enabled (TCE = 1). Each count
 * value of one represents a single quadrature cycle interpreted as a count of one
 * by the position counter (UPOS and LPOS) if it is so enabled. Repeated writing
 * of new values to TEST_COUNT can cause an extra phase transition and therefore
 * an extra count by the position counter. The period field determines in IPBus
 * clock cycles the length of each quadrature cycle phase. This register is a
 * factory test feature; however, it may be useful to customers' software
 * development and testing.
 */
/*!
 * @name Constants and macros for entire ENC_TST register
 */
/*@{*/
#define ENC_RD_TST(base)         (ENC_TST_REG(base))
#define ENC_WR_TST(base, value)  (ENC_TST_REG(base) = (value))
#define ENC_RMW_TST(base, mask, value) (ENC_WR_TST(base, (ENC_RD_TST(base) & ~(mask)) | (value)))
#define ENC_SET_TST(base, value) (ENC_WR_TST(base, ENC_RD_TST(base) |  (value)))
#define ENC_CLR_TST(base, value) (ENC_WR_TST(base, ENC_RD_TST(base) & ~(value)))
#define ENC_TOG_TST(base, value) (ENC_WR_TST(base, ENC_RD_TST(base) ^  (value)))
/*@}*/

