theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*
 * Constants & macros for individual MCM_ISR bitfields
 */

/*!
 * @name Register MCM_ISR, field FIOC[8] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IOC] bit and signals an
 * illegal operation has been detected in the processor's FPU. Once set, this bit
 * remains set until software clears the FPSCR[IOC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIOC field. */
#define MCM_RD_ISR_FIOC(base) ((MCM_ISR_REG(base) & MCM_ISR_FIOC_MASK) >> MCM_ISR_FIOC_SHIFT)
#define MCM_BRD_ISR_FIOC(base) (MCM_RD_ISR_FIOC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FDZC[9] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[DZC] bit and signals a
 * divide by zero has been detected in the processor's FPU. Once set, this bit remains
 * set until software clears the FPSCR[DZC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FDZC field. */
#define MCM_RD_ISR_FDZC(base) ((MCM_ISR_REG(base) & MCM_ISR_FDZC_MASK) >> MCM_ISR_FDZC_SHIFT)
#define MCM_BRD_ISR_FDZC(base) (MCM_RD_ISR_FDZC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FOFC[10] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[OFC] bit and signals an
 * overflow has been detected in the processor's FPU. Once set, this bit remains set
 * until software clears the FPSCR[OFC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FOFC field. */
#define MCM_RD_ISR_FOFC(base) ((MCM_ISR_REG(base) & MCM_ISR_FOFC_MASK) >> MCM_ISR_FOFC_SHIFT)
#define MCM_BRD_ISR_FOFC(base) (MCM_RD_ISR_FOFC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FUFC[11] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[UFC] bit and signals an
 * underflow has been detected in the processor's FPU. Once set, this bit remains set
 * until software clears the FPSCR[UFC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FUFC field. */
#define MCM_RD_ISR_FUFC(base) ((MCM_ISR_REG(base) & MCM_ISR_FUFC_MASK) >> MCM_ISR_FUFC_SHIFT)
#define MCM_BRD_ISR_FUFC(base) (MCM_RD_ISR_FUFC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FIXC[12] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IXC] bit and signals an
 * inexact number has been detected in the processor's FPU. Once set, this bit
 * remains set until software clears the FPSCR[IXC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIXC field. */
#define MCM_RD_ISR_FIXC(base) ((MCM_ISR_REG(base) & MCM_ISR_FIXC_MASK) >> MCM_ISR_FIXC_SHIFT)
#define MCM_BRD_ISR_FIXC(base) (MCM_RD_ISR_FIXC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FIDC[15] (RO)
 *
 * This read-only bit is a copy of the core's FPSCR[IDC] bit and signals input
 * denormalized number has been detected in the processor's FPU. Once set, this
 * bit remains set until software clears the FPSCR[IDC] bit.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIDC field. */
#define MCM_RD_ISR_FIDC(base) ((MCM_ISR_REG(base) & MCM_ISR_FIDC_MASK) >> MCM_ISR_FIDC_SHIFT)
#define MCM_BRD_ISR_FIDC(base) (MCM_RD_ISR_FIDC(base))
/*@}*/

/*!
 * @name Register MCM_ISR, field FIOCE[24] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIOCE field. */
#define MCM_RD_ISR_FIOCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FIOCE_MASK) >> MCM_ISR_FIOCE_SHIFT)
#define MCM_BRD_ISR_FIOCE(base) (MCM_RD_ISR_FIOCE(base))

/*! @brief Set the FIOCE field to a new value. */
#define MCM_WR_ISR_FIOCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FIOCE_MASK, MCM_ISR_FIOCE(value)))
#define MCM_BWR_ISR_FIOCE(base, value) (MCM_WR_ISR_FIOCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field FDZCE[25] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FDZCE field. */
#define MCM_RD_ISR_FDZCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FDZCE_MASK) >> MCM_ISR_FDZCE_SHIFT)
#define MCM_BRD_ISR_FDZCE(base) (MCM_RD_ISR_FDZCE(base))

/*! @brief Set the FDZCE field to a new value. */
#define MCM_WR_ISR_FDZCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FDZCE_MASK, MCM_ISR_FDZCE(value)))
#define MCM_BWR_ISR_FDZCE(base, value) (MCM_WR_ISR_FDZCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field FOFCE[26] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FOFCE field. */
#define MCM_RD_ISR_FOFCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FOFCE_MASK) >> MCM_ISR_FOFCE_SHIFT)
#define MCM_BRD_ISR_FOFCE(base) (MCM_RD_ISR_FOFCE(base))

/*! @brief Set the FOFCE field to a new value. */
#define MCM_WR_ISR_FOFCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FOFCE_MASK, MCM_ISR_FOFCE(value)))
#define MCM_BWR_ISR_FOFCE(base, value) (MCM_WR_ISR_FOFCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field FUFCE[27] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FUFCE field. */
#define MCM_RD_ISR_FUFCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FUFCE_MASK) >> MCM_ISR_FUFCE_SHIFT)
#define MCM_BRD_ISR_FUFCE(base) (MCM_RD_ISR_FUFCE(base))

/*! @brief Set the FUFCE field to a new value. */
#define MCM_WR_ISR_FUFCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FUFCE_MASK, MCM_ISR_FUFCE(value)))
#define MCM_BWR_ISR_FUFCE(base, value) (MCM_WR_ISR_FUFCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field FIXCE[28] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIXCE field. */
#define MCM_RD_ISR_FIXCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FIXCE_MASK) >> MCM_ISR_FIXCE_SHIFT)
#define MCM_BRD_ISR_FIXCE(base) (MCM_RD_ISR_FIXCE(base))

/*! @brief Set the FIXCE field to a new value. */
#define MCM_WR_ISR_FIXCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FIXCE_MASK, MCM_ISR_FIXCE(value)))
#define MCM_BWR_ISR_FIXCE(base, value) (MCM_WR_ISR_FIXCE(base, value))
/*@}*/

/*!
 * @name Register MCM_ISR, field FIDCE[31] (RW)
 *
 * Values:
 * - 0 - Disable interrupt
 * - 1 - Enable interrupt
 */
/*@{*/
/*! @brief Read current value of the MCM_ISR_FIDCE field. */
#define MCM_RD_ISR_FIDCE(base) ((MCM_ISR_REG(base) & MCM_ISR_FIDCE_MASK) >> MCM_ISR_FIDCE_SHIFT)
#define MCM_BRD_ISR_FIDCE(base) (MCM_RD_ISR_FIDCE(base))

/*! @brief Set the FIDCE field to a new value. */
#define MCM_WR_ISR_FIDCE(base, value) (MCM_RMW_ISR(base, MCM_ISR_FIDCE_MASK, MCM_ISR_FIDCE(value)))
#define MCM_BWR_ISR_FIDCE(base, value) (MCM_WR_ISR_FIDCE(base, value))
/*@}*/

