theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*
 * Constants & macros for individual PWM_DTCNT1 bitfields
 */

/*!
 * @name Register PWM_DTCNT1, field DTCNT1[10:0] (RW)
 *
 * The DTCNT1 field is used to control the deadtime during 0 to 1 transitions of
 * the complementary PWM_B output.
 */
/*@{*/
/*! @brief Read current value of the PWM_DTCNT1_DTCNT1 field. */
#define PWM_RD_DTCNT1_DTCNT1(base, index) ((PWM_DTCNT1_REG(base, index) & PWM_DTCNT1_DTCNT1_MASK) >> PWM_DTCNT1_DTCNT1_SHIFT)
#define PWM_BRD_DTCNT1_DTCNT1(base, index) (PWM_RD_DTCNT1_DTCNT1(base, index))

/*! @brief Set the DTCNT1 field to a new value. */
#define PWM_WR_DTCNT1_DTCNT1(base, index, value) (PWM_RMW_DTCNT1(base, index, PWM_DTCNT1_DTCNT1_MASK, PWM_DTCNT1_DTCNT1(value)))
#define PWM_BWR_DTCNT1_DTCNT1(base, index, value) (PWM_WR_DTCNT1_DTCNT1(base, index, value))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCTRLA - Capture Control A Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCTRLA - Capture Control A Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCTRLA register
 */
/*@{*/
#define PWM_RD_CAPTCTRLA(base, index) (PWM_CAPTCTRLA_REG(base, index))
#define PWM_WR_CAPTCTRLA(base, index, value) (PWM_CAPTCTRLA_REG(base, index) = (value))
#define PWM_RMW_CAPTCTRLA(base, index, mask, value) (PWM_WR_CAPTCTRLA(base, index, (PWM_RD_CAPTCTRLA(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCTRLA(base, index, value) (PWM_WR_CAPTCTRLA(base, index, PWM_RD_CAPTCTRLA(base, index) |  (value)))
#define PWM_CLR_CAPTCTRLA(base, index, value) (PWM_WR_CAPTCTRLA(base, index, PWM_RD_CAPTCTRLA(base, index) & ~(value)))
#define PWM_TOG_CAPTCTRLA(base, index, value) (PWM_WR_CAPTCTRLA(base, index, PWM_RD_CAPTCTRLA(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCTRLA bitfields
 */

/*!
 * @name Register PWM_CAPTCTRLA, field ARMA[0] (RW)
 *
 * Setting this bit high starts the input capture process. This bit can be
 * cleared at any time to disable input capture operation. This bit is self-cleared
 * when in one shot mode and one or more of the enabled capture circuits has had a
 * capture event.
 *
 * Values:
 * - 0 - Input capture operation is disabled.
 * - 1 - Input capture operation as specified by CAPTCTRLA[EDGAx] is enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_ARMA field. */
#define PWM_RD_CAPTCTRLA_ARMA(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_ARMA_MASK) >> PWM_CAPTCTRLA_ARMA_SHIFT)
#define PWM_BRD_CAPTCTRLA_ARMA(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_ARMA_SHIFT))

/*! @brief Set the ARMA field to a new value. */
#define PWM_WR_CAPTCTRLA_ARMA(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_ARMA_MASK, PWM_CAPTCTRLA_ARMA(value)))
#define PWM_BWR_CAPTCTRLA_ARMA(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_ARMA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field ONESHOTA[1] (RW)
 *
 * This bit selects between free running and one shot mode for the input capture
 * circuitry.
 *
 * Values:
 * - 0 - Free running mode is selected. If both capture circuits are enabled,
 *     then capture circuit 0 is armed first after CAPTCTRLA[ARMA] is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is
 *     armed. After capture circuit 1 performs a capture, it is disarmed and capture
 *     circuit 0 is re-armed. The process continues indefinitely. If only one of
 *     the capture circuits is enabled, then captures continue indefinitely on
 *     the enabled capture circuit.
 * - 1 - One shot mode is selected. If both capture circuits are enabled, then
 *     capture circuit 0 is armed first after CAPTCTRLA[ARMA] is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is armed.
 *     After capture circuit 1 performs a capture, it is disarmed and
 *     CAPTCTRLA[ARMA] is cleared. No further captures will be performed until
 *     CAPTCTRLA[ARMA] is set again. If only one of the capture circuits is enabled, then a
 *     single capture will occur on the enabled capture circuit and CAPTCTRLA[ARMA]
 *     is then cleared.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_ONESHOTA field. */
#define PWM_RD_CAPTCTRLA_ONESHOTA(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_ONESHOTA_MASK) >> PWM_CAPTCTRLA_ONESHOTA_SHIFT)
#define PWM_BRD_CAPTCTRLA_ONESHOTA(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_ONESHOTA_SHIFT))

/*! @brief Set the ONESHOTA field to a new value. */
#define PWM_WR_CAPTCTRLA_ONESHOTA(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_ONESHOTA_MASK, PWM_CAPTCTRLA_ONESHOTA(value)))
#define PWM_BWR_CAPTCTRLA_ONESHOTA(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_ONESHOTA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field EDGA0[3:2] (RW)
 *
 * These bits control the input capture 0 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_EDGA0 field. */
#define PWM_RD_CAPTCTRLA_EDGA0(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_EDGA0_MASK) >> PWM_CAPTCTRLA_EDGA0_SHIFT)
#define PWM_BRD_CAPTCTRLA_EDGA0(base, index) (PWM_RD_CAPTCTRLA_EDGA0(base, index))

/*! @brief Set the EDGA0 field to a new value. */
#define PWM_WR_CAPTCTRLA_EDGA0(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_EDGA0_MASK, PWM_CAPTCTRLA_EDGA0(value)))
#define PWM_BWR_CAPTCTRLA_EDGA0(base, index, value) (PWM_WR_CAPTCTRLA_EDGA0(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field EDGA1[5:4] (RW)
 *
 * These bits control the input capture 1 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_EDGA1 field. */
#define PWM_RD_CAPTCTRLA_EDGA1(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_EDGA1_MASK) >> PWM_CAPTCTRLA_EDGA1_SHIFT)
#define PWM_BRD_CAPTCTRLA_EDGA1(base, index) (PWM_RD_CAPTCTRLA_EDGA1(base, index))

/*! @brief Set the EDGA1 field to a new value. */
#define PWM_WR_CAPTCTRLA_EDGA1(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_EDGA1_MASK, PWM_CAPTCTRLA_EDGA1(value)))
#define PWM_BWR_CAPTCTRLA_EDGA1(base, index, value) (PWM_WR_CAPTCTRLA_EDGA1(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field INP_SELA[6] (RW)
 *
 * This bit selects between the raw PWM_A input signal and the output of the
 * edge counter/compare circuitry as the source for the input capture circuit.
 *
 * Values:
 * - 0 - Raw PWM_A input signal selected as source.
 * - 1 - Output of edge counter/compare selected as source. When this bitfield
 *     is set to 1, the internal edge counter is enabled and the rising and/or
 *     falling edges specified by the CAPTCTRLA[EDGA0] and CAPTCTRLA[EDGA1] fields
 *     are ignored. The software must still place a value other than 00 in either
 *     or both of the CAPTCTLRA[EDGA0] and/or CAPTCTRLA[EDGA1] fields in order to
 *     enable one or both of the capture registers.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_INP_SELA field. */
#define PWM_RD_CAPTCTRLA_INP_SELA(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_INP_SELA_MASK) >> PWM_CAPTCTRLA_INP_SELA_SHIFT)
#define PWM_BRD_CAPTCTRLA_INP_SELA(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_INP_SELA_SHIFT))

/*! @brief Set the INP_SELA field to a new value. */
#define PWM_WR_CAPTCTRLA_INP_SELA(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_INP_SELA_MASK, PWM_CAPTCTRLA_INP_SELA(value)))
#define PWM_BWR_CAPTCTRLA_INP_SELA(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_INP_SELA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field EDGCNTA_EN[7] (RW)
 *
 * This bit enables the edge counter which counts rising and falling edges on
 * the PWM_A input signal.
 *
 * Values:
 * - 0 - Edge counter disabled and held in reset
 * - 1 - Edge counter enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_EDGCNTA_EN field. */
#define PWM_RD_CAPTCTRLA_EDGCNTA_EN(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_EDGCNTA_EN_MASK) >> PWM_CAPTCTRLA_EDGCNTA_EN_SHIFT)
#define PWM_BRD_CAPTCTRLA_EDGCNTA_EN(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_EDGCNTA_EN_SHIFT))

