theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the EDGCNTA_EN field to a new value. */
#define PWM_WR_CAPTCTRLA_EDGCNTA_EN(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_EDGCNTA_EN_MASK, PWM_CAPTCTRLA_EDGCNTA_EN(value)))
#define PWM_BWR_CAPTCTRLA_EDGCNTA_EN(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLA_REG(base, index), PWM_CAPTCTRLA_EDGCNTA_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field CFAWM[9:8] (RW)
 *
 * This field represents the water mark level for capture A FIFOs. The capture
 * flags, STS[CFA1] and STS[CFA0], are not set until the word count of the
 * corresponding FIFO is greater than this water mark level. (FIFO depth is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_CFAWM field. */
#define PWM_RD_CAPTCTRLA_CFAWM(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_CFAWM_MASK) >> PWM_CAPTCTRLA_CFAWM_SHIFT)
#define PWM_BRD_CAPTCTRLA_CFAWM(base, index) (PWM_RD_CAPTCTRLA_CFAWM(base, index))

/*! @brief Set the CFAWM field to a new value. */
#define PWM_WR_CAPTCTRLA_CFAWM(base, index, value) (PWM_RMW_CAPTCTRLA(base, index, PWM_CAPTCTRLA_CFAWM_MASK, PWM_CAPTCTRLA_CFAWM(value)))
#define PWM_BWR_CAPTCTRLA_CFAWM(base, index, value) (PWM_WR_CAPTCTRLA_CFAWM(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field CA0CNT[12:10] (RO)
 *
 * This field reflects the number of words in the Capture A0 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_CA0CNT field. */
#define PWM_RD_CAPTCTRLA_CA0CNT(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_CA0CNT_MASK) >> PWM_CAPTCTRLA_CA0CNT_SHIFT)
#define PWM_BRD_CAPTCTRLA_CA0CNT(base, index) (PWM_RD_CAPTCTRLA_CA0CNT(base, index))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLA, field CA1CNT[15:13] (RO)
 *
 * This field reflects the number of words in the Capture A1 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLA_CA1CNT field. */
#define PWM_RD_CAPTCTRLA_CA1CNT(base, index) ((PWM_CAPTCTRLA_REG(base, index) & PWM_CAPTCTRLA_CA1CNT_MASK) >> PWM_CAPTCTRLA_CA1CNT_SHIFT)
#define PWM_BRD_CAPTCTRLA_CA1CNT(base, index) (PWM_RD_CAPTCTRLA_CA1CNT(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCOMPA - Capture Compare A Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCOMPA - Capture Compare A Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCOMPA register
 */
/*@{*/
#define PWM_RD_CAPTCOMPA(base, index) (PWM_CAPTCOMPA_REG(base, index))
#define PWM_WR_CAPTCOMPA(base, index, value) (PWM_CAPTCOMPA_REG(base, index) = (value))
#define PWM_RMW_CAPTCOMPA(base, index, mask, value) (PWM_WR_CAPTCOMPA(base, index, (PWM_RD_CAPTCOMPA(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCOMPA(base, index, value) (PWM_WR_CAPTCOMPA(base, index, PWM_RD_CAPTCOMPA(base, index) |  (value)))
#define PWM_CLR_CAPTCOMPA(base, index, value) (PWM_WR_CAPTCOMPA(base, index, PWM_RD_CAPTCOMPA(base, index) & ~(value)))
#define PWM_TOG_CAPTCOMPA(base, index, value) (PWM_WR_CAPTCOMPA(base, index, PWM_RD_CAPTCOMPA(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCOMPA bitfields
 */

/*!
 * @name Register PWM_CAPTCOMPA, field EDGCMPA[7:0] (RW)
 *
 * This read/write field is the compare value associated with the edge counter
 * for the PWM_A input capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPA_EDGCMPA field. */
#define PWM_RD_CAPTCOMPA_EDGCMPA(base, index) ((PWM_CAPTCOMPA_REG(base, index) & PWM_CAPTCOMPA_EDGCMPA_MASK) >> PWM_CAPTCOMPA_EDGCMPA_SHIFT)
#define PWM_BRD_CAPTCOMPA_EDGCMPA(base, index) (PWM_RD_CAPTCOMPA_EDGCMPA(base, index))

/*! @brief Set the EDGCMPA field to a new value. */
#define PWM_WR_CAPTCOMPA_EDGCMPA(base, index, value) (PWM_RMW_CAPTCOMPA(base, index, PWM_CAPTCOMPA_EDGCMPA_MASK, PWM_CAPTCOMPA_EDGCMPA(value)))
#define PWM_BWR_CAPTCOMPA_EDGCMPA(base, index, value) (PWM_WR_CAPTCOMPA_EDGCMPA(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCOMPA, field EDGCNTA[15:8] (RO)
 *
 * This read-only field contains the edge counter value for the PWM_A input
 * capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPA_EDGCNTA field. */
#define PWM_RD_CAPTCOMPA_EDGCNTA(base, index) ((PWM_CAPTCOMPA_REG(base, index) & PWM_CAPTCOMPA_EDGCNTA_MASK) >> PWM_CAPTCOMPA_EDGCNTA_SHIFT)
#define PWM_BRD_CAPTCOMPA_EDGCNTA(base, index) (PWM_RD_CAPTCOMPA_EDGCNTA(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCTRLB - Capture Control B Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCTRLB - Capture Control B Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCTRLB register
 */
/*@{*/
#define PWM_RD_CAPTCTRLB(base, index) (PWM_CAPTCTRLB_REG(base, index))
#define PWM_WR_CAPTCTRLB(base, index, value) (PWM_CAPTCTRLB_REG(base, index) = (value))
#define PWM_RMW_CAPTCTRLB(base, index, mask, value) (PWM_WR_CAPTCTRLB(base, index, (PWM_RD_CAPTCTRLB(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCTRLB(base, index, value) (PWM_WR_CAPTCTRLB(base, index, PWM_RD_CAPTCTRLB(base, index) |  (value)))
#define PWM_CLR_CAPTCTRLB(base, index, value) (PWM_WR_CAPTCTRLB(base, index, PWM_RD_CAPTCTRLB(base, index) & ~(value)))
#define PWM_TOG_CAPTCTRLB(base, index, value) (PWM_WR_CAPTCTRLB(base, index, PWM_RD_CAPTCTRLB(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCTRLB bitfields
 */

/*!
 * @name Register PWM_CAPTCTRLB, field ARMB[0] (RW)
 *
 * Setting this bit high starts the input capture process. This bit can be
 * cleared at any time to disable input capture operation. This bit is self-cleared
 * when in one shot mode and one or more of the enabled capture circuits has had a
 * capture event.
 *
 * Values:
 * - 0 - Input capture operation is disabled.
 * - 1 - Input capture operation as specified by CAPTCTRLB[EDGBx] is enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_ARMB field. */
#define PWM_RD_CAPTCTRLB_ARMB(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_ARMB_MASK) >> PWM_CAPTCTRLB_ARMB_SHIFT)
#define PWM_BRD_CAPTCTRLB_ARMB(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_ARMB_SHIFT))

