theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*
 * Constants & macros for individual PWM_CVAL2CYC bitfields
 */

/*!
 * @name Register PWM_CVAL2CYC, field CVAL2CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL2. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL2CYC_CVAL2CYC field. */
#define PWM_RD_CVAL2CYC_CVAL2CYC(base, index) ((PWM_CVAL2CYC_REG(base, index) & PWM_CVAL2CYC_CVAL2CYC_MASK) >> PWM_CVAL2CYC_CVAL2CYC_SHIFT)
#define PWM_BRD_CVAL2CYC_CVAL2CYC(base, index) (PWM_RD_CVAL2CYC_CVAL2CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL3 - Capture Value 3 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL3 - Capture Value 3 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL3 register
 */
/*@{*/
#define PWM_RD_CVAL3(base, index) (PWM_CVAL3_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL3CYC - Capture Value 3 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL3CYC - Capture Value 3 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL3CYC register
 */
/*@{*/
#define PWM_RD_CVAL3CYC(base, index) (PWM_CVAL3CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL3CYC bitfields
 */

/*!
 * @name Register PWM_CVAL3CYC, field CVAL3CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL3. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL3CYC_CVAL3CYC field. */
#define PWM_RD_CVAL3CYC_CVAL3CYC(base, index) ((PWM_CVAL3CYC_REG(base, index) & PWM_CVAL3CYC_CVAL3CYC_MASK) >> PWM_CVAL3CYC_CVAL3CYC_SHIFT)
#define PWM_BRD_CVAL3CYC_CVAL3CYC(base, index) (PWM_RD_CVAL3CYC_CVAL3CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL4 - Capture Value 4 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL4 - Capture Value 4 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL4 register
 */
/*@{*/
#define PWM_RD_CVAL4(base, index) (PWM_CVAL4_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL4CYC - Capture Value 4 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL4CYC - Capture Value 4 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL4CYC register
 */
/*@{*/
#define PWM_RD_CVAL4CYC(base, index) (PWM_CVAL4CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL4CYC bitfields
 */

/*!
 * @name Register PWM_CVAL4CYC, field CVAL4CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL4. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL4CYC_CVAL4CYC field. */
#define PWM_RD_CVAL4CYC_CVAL4CYC(base, index) ((PWM_CVAL4CYC_REG(base, index) & PWM_CVAL4CYC_CVAL4CYC_MASK) >> PWM_CVAL4CYC_CVAL4CYC_SHIFT)
#define PWM_BRD_CVAL4CYC_CVAL4CYC(base, index) (PWM_RD_CVAL4CYC_CVAL4CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL5 - Capture Value 5 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL5 - Capture Value 5 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL5 register
 */
/*@{*/
#define PWM_RD_CVAL5(base, index) (PWM_CVAL5_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL5CYC - Capture Value 5 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL5CYC - Capture Value 5 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL5CYC register
 */
/*@{*/
#define PWM_RD_CVAL5CYC(base, index) (PWM_CVAL5CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL5CYC bitfields
 */

/*!
 * @name Register PWM_CVAL5CYC, field CVAL5CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL5. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL5CYC_CVAL5CYC field. */
#define PWM_RD_CVAL5CYC_CVAL5CYC(base, index) ((PWM_CVAL5CYC_REG(base, index) & PWM_CVAL5CYC_CVAL5CYC_MASK) >> PWM_CVAL5CYC_CVAL5CYC_SHIFT)
#define PWM_BRD_CVAL5CYC_CVAL5CYC(base, index) (PWM_RD_CVAL5CYC_CVAL5CYC(base, index))
/*@}*/

/*******************************************************************************
 * PWM_OUTEN - Output Enable Register
 ******************************************************************************/

/*!
 * @brief PWM_OUTEN - Output Enable Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_OUTEN register
 */
/*@{*/
#define PWM_RD_OUTEN(base)       (PWM_OUTEN_REG(base))
#define PWM_WR_OUTEN(base, value) (PWM_OUTEN_REG(base) = (value))
#define PWM_RMW_OUTEN(base, mask, value) (PWM_WR_OUTEN(base, (PWM_RD_OUTEN(base) & ~(mask)) | (value)))
#define PWM_SET_OUTEN(base, value) (PWM_WR_OUTEN(base, PWM_RD_OUTEN(base) |  (value)))
#define PWM_CLR_OUTEN(base, value) (PWM_WR_OUTEN(base, PWM_RD_OUTEN(base) & ~(value)))
#define PWM_TOG_OUTEN(base, value) (PWM_WR_OUTEN(base, PWM_RD_OUTEN(base) ^  (value)))
/*@}*/

