theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the LDOK field to a new value. */
#define PWM_WR_MCTRL_LDOK(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_LDOK_MASK, PWM_MCTRL_LDOK(value)))
#define PWM_BWR_MCTRL_LDOK(base, value) (PWM_WR_MCTRL_LDOK(base, value))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field CLDOK[7:4] (WORZ)
 *
 * The 4 bits of CLDOK field correspond to submodules 3-0, respectively. Each
 * write-only bit is used to clear the corresponding bit of MCTRL[LDOK]. Write a 1
 * to CLDOK to clear the corresponding MCTRL[LDOK] bit. If a reload occurs within
 * a submodule with the corresponding MCTRL[LDOK] bit set at the same time that
 * MCTRL[CLDOK] is written, then the reload in that submodule will not be
 * performed and MCTRL[LDOK] will be cleared. CLDOK bit is self-clearing and always
 * reads as a 0.
 */
/*@{*/
/*! @brief Set the CLDOK field to a new value. */
#define PWM_WR_MCTRL_CLDOK(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_CLDOK_MASK, PWM_MCTRL_CLDOK(value)))
#define PWM_BWR_MCTRL_CLDOK(base, value) (PWM_WR_MCTRL_CLDOK(base, value))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field RUN[11:8] (RW)
 *
 * The four read/write bits of this field enable the clocks to the PWM generator
 * of submodules 3-0, respectively. The corresponding MCTRL[RUN] bit must be set
 * for each submodule that is using its input capture functions or is using the
 * local reload as its reload source. When this bit equals zero, the submodule
 * counter is reset. A reset clears this field.
 *
 * Values:
 * - 0 - PWM generator is disabled in the corresponding submodule.
 * - 1 - PWM generator is enabled in the corresponding submodule.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL_RUN field. */
#define PWM_RD_MCTRL_RUN(base) ((PWM_MCTRL_REG(base) & PWM_MCTRL_RUN_MASK) >> PWM_MCTRL_RUN_SHIFT)
#define PWM_BRD_MCTRL_RUN(base) (PWM_RD_MCTRL_RUN(base))

/*! @brief Set the RUN field to a new value. */
#define PWM_WR_MCTRL_RUN(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_RUN_MASK, PWM_MCTRL_RUN(value)))
#define PWM_BWR_MCTRL_RUN(base, value) (PWM_WR_MCTRL_RUN(base, value))
/*@}*/

/*!
 * @name Register PWM_MCTRL, field IPOL[15:12] (RW)
 *
 * The four buffered read/write bits of this field correspond to submodules 3-0,
 * respectively. Each bit selects between PWM23 and PWM45 as the source for the
 * generation of the complementary PWM pair output for the corresponding
 * submodule. MCTRL[IPOL] is ignored in independent mode. MCTRL[IPOL] does not take
 * effect until a FORCE_OUT event takes place in the appropriate submodule. Reading
 * MCTRL[IPOL] reads the buffered value and not necessarily the value currently in
 * effect.
 *
 * Values:
 * - 0 - PWM23 is used to generate complementary PWM pair in the corresponding
 *     submodule.
 * - 1 - PWM45 is used to generate complementary PWM pair in the corresponding
 *     submodule.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL_IPOL field. */
#define PWM_RD_MCTRL_IPOL(base) ((PWM_MCTRL_REG(base) & PWM_MCTRL_IPOL_MASK) >> PWM_MCTRL_IPOL_SHIFT)
#define PWM_BRD_MCTRL_IPOL(base) (PWM_RD_MCTRL_IPOL(base))

/*! @brief Set the IPOL field to a new value. */
#define PWM_WR_MCTRL_IPOL(base, value) (PWM_RMW_MCTRL(base, PWM_MCTRL_IPOL_MASK, PWM_MCTRL_IPOL(value)))
#define PWM_BWR_MCTRL_IPOL(base, value) (PWM_WR_MCTRL_IPOL(base, value))
/*@}*/

/*******************************************************************************
 * PWM_MCTRL2 - Master Control 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_MCTRL2 - Master Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_MCTRL2 register
 */
/*@{*/
#define PWM_RD_MCTRL2(base)      (PWM_MCTRL2_REG(base))
#define PWM_WR_MCTRL2(base, value) (PWM_MCTRL2_REG(base) = (value))
#define PWM_RMW_MCTRL2(base, mask, value) (PWM_WR_MCTRL2(base, (PWM_RD_MCTRL2(base) & ~(mask)) | (value)))
#define PWM_SET_MCTRL2(base, value) (PWM_WR_MCTRL2(base, PWM_RD_MCTRL2(base) |  (value)))
#define PWM_CLR_MCTRL2(base, value) (PWM_WR_MCTRL2(base, PWM_RD_MCTRL2(base) & ~(value)))
#define PWM_TOG_MCTRL2(base, value) (PWM_WR_MCTRL2(base, PWM_RD_MCTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_MCTRL2 bitfields
 */

/*!
 * @name Register PWM_MCTRL2, field MONPLL[1:0] (RW)
 *
 * These bits are used to control disabling of the fractional delay block when
 * the chip PLL is unlocked and/or missing its input reference. The fractional
 * delay block requires a continuous 200 MHz clock from the PLL. If this clock turns
 * off when the fractional delay block is being used, then the output of the
 * fractional delay block can be stuck high or low even if the PLL restarts. When
 * this control bit is set, PLL problems cause the fractional delay block to be
 * disabled until the PLL returns to a locked state. Once the PLL is receiving a
 * proper reference and is locked, the fractional delay block requires a 25 us
 * startup time just as if the FRCTRL[FRAC*_EN] bits had been turned off and turned on
 * again. If PLL monitoring is disabled, then software should manually clear and
 * then set the FRCTRL[FRAC*_EN] bits when the PLL loses its reference or loses
 * lock. This will cause the fractional delay block to be disabled and restarted.
 * If the fractional delay block is not being used, then the value of these bits
 * do not matter.
 *
 * Values:
 * - 00 - Not locked. Do not monitor PLL operation. Resetting of the fractional
 *     delay block in case of PLL losing lock will be controlled by software.
 * - 01 - Not locked. Monitor PLL operation to automatically disable the
 *     fractional delay block when the PLL encounters problems.
 * - 10 - Locked. Do not monitor PLL operation. Resetting of the fractional
 *     delay block in case of PLL losing lock will be controlled by software. These
 *     bits are write protected until the next reset.
 * - 11 - Locked. Monitor PLL operation to automatically disable the fractional
 *     delay block when the PLL encounters problems. These bits are write
 *     protected until the next reset.
 */
/*@{*/
/*! @brief Read current value of the PWM_MCTRL2_MONPLL field. */
#define PWM_RD_MCTRL2_MONPLL(base) ((PWM_MCTRL2_REG(base) & PWM_MCTRL2_MONPLL_MASK) >> PWM_MCTRL2_MONPLL_SHIFT)
#define PWM_BRD_MCTRL2_MONPLL(base) (PWM_RD_MCTRL2_MONPLL(base))

/*! @brief Set the MONPLL field to a new value. */
#define PWM_WR_MCTRL2_MONPLL(base, value) (PWM_RMW_MCTRL2(base, PWM_MCTRL2_MONPLL_MASK, PWM_MCTRL2_MONPLL(value)))
#define PWM_BWR_MCTRL2_MONPLL(base, value) (PWM_WR_MCTRL2_MONPLL(base, value))
/*@}*/

