theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * PWM_FTST - Fault Test Register
 ******************************************************************************/

/*!
 * @brief PWM_FTST - Fault Test Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FTST register
 */
/*@{*/
#define PWM_RD_FTST(base)        (PWM_FTST_REG(base))
#define PWM_WR_FTST(base, value) (PWM_FTST_REG(base) = (value))
#define PWM_RMW_FTST(base, mask, value) (PWM_WR_FTST(base, (PWM_RD_FTST(base) & ~(mask)) | (value)))
#define PWM_SET_FTST(base, value) (PWM_WR_FTST(base, PWM_RD_FTST(base) |  (value)))
#define PWM_CLR_FTST(base, value) (PWM_WR_FTST(base, PWM_RD_FTST(base) & ~(value)))
#define PWM_TOG_FTST(base, value) (PWM_WR_FTST(base, PWM_RD_FTST(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FTST bitfields
 */

/*!
 * @name Register PWM_FTST, field FTEST[0] (RW)
 *
 * This read/write bit is used to simulate a fault condition. Setting this bit
 * causes a simulated fault to be sent into all of the fault filters. The
 * condition propagates to the fault flags and possibly the PWM outputs depending on the
 * DISMAPn settings. Clearing this bit removes the simulated fault condition.
 *
 * Values:
 * - 0 - No fault
 * - 1 - Cause a simulated fault
 */
/*@{*/
/*! @brief Read current value of the PWM_FTST_FTEST field. */
#define PWM_RD_FTST_FTEST(base) ((PWM_FTST_REG(base) & PWM_FTST_FTEST_MASK) >> PWM_FTST_FTEST_SHIFT)
#define PWM_BRD_FTST_FTEST(base) (BITBAND_ACCESS16(&PWM_FTST_REG(base), PWM_FTST_FTEST_SHIFT))

/*! @brief Set the FTEST field to a new value. */
#define PWM_WR_FTST_FTEST(base, value) (PWM_RMW_FTST(base, PWM_FTST_FTEST_MASK, PWM_FTST_FTEST(value)))
#define PWM_BWR_FTST_FTEST(base, value) (BITBAND_ACCESS16(&PWM_FTST_REG(base), PWM_FTST_FTEST_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * PWM_FCTRL2 - Fault Control 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_FCTRL2 - Fault Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FCTRL2 register
 */
/*@{*/
#define PWM_RD_FCTRL2(base)      (PWM_FCTRL2_REG(base))
#define PWM_WR_FCTRL2(base, value) (PWM_FCTRL2_REG(base) = (value))
#define PWM_RMW_FCTRL2(base, mask, value) (PWM_WR_FCTRL2(base, (PWM_RD_FCTRL2(base) & ~(mask)) | (value)))
#define PWM_SET_FCTRL2(base, value) (PWM_WR_FCTRL2(base, PWM_RD_FCTRL2(base) |  (value)))
#define PWM_CLR_FCTRL2(base, value) (PWM_WR_FCTRL2(base, PWM_RD_FCTRL2(base) & ~(value)))
#define PWM_TOG_FCTRL2(base, value) (PWM_WR_FCTRL2(base, PWM_RD_FCTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FCTRL2 bitfields
 */

/*!
 * @name Register PWM_FCTRL2, field NOCOMB[3:0] (RW)
 *
 * This read/write field is used to control the combinational path from the
 * fault inputs to the PWM outputs. When these bits are low (default), the
 * corresponding fault inputs have a combinational path to the PWM outputs that are
 * sensitive to these fault inputs (as defined by DISMAP0). This combinational path is a
 * safety feature that ensures the output is disabled even if the SOC has a
 * failure of its clocking system. The combinational path also means that a pulse on
 * the fault input can cause a brief disable of the PWM output even if the fault
 * pulse is not wide enaough to get through the input filter and be latched in
 * the fault logic. Setting these bits removes the combinational path and uses the
 * filterred and latched fault signals as the fault source to disable the PWM
 * outputs. This eliminates fault glitches from creating PWM output glitches but
 * also increases the latency to respond to a real fault.
 *
 * Values:
 * - 0 - There is a combinational link from the fault inputs to the PWM outputs.
 *     The fault inputs are combined with the filtered and latched fault signals
 *     to disable the PWM outputs.
 * - 1 - The direct combinational path from the fault inputs to the PWM outputs
 *     is disabled and the filtered and latched fault signals are used to disable
 *     the PWM outputs.
 */
/*@{*/
/*! @brief Read current value of the PWM_FCTRL2_NOCOMB field. */
#define PWM_RD_FCTRL2_NOCOMB(base) ((PWM_FCTRL2_REG(base) & PWM_FCTRL2_NOCOMB_MASK) >> PWM_FCTRL2_NOCOMB_SHIFT)
#define PWM_BRD_FCTRL2_NOCOMB(base) (PWM_RD_FCTRL2_NOCOMB(base))

/*! @brief Set the NOCOMB field to a new value. */
#define PWM_WR_FCTRL2_NOCOMB(base, value) (PWM_RMW_FCTRL2(base, PWM_FCTRL2_NOCOMB_MASK, PWM_FCTRL2_NOCOMB(value)))
#define PWM_BWR_FCTRL2_NOCOMB(base, value) (PWM_WR_FCTRL2_NOCOMB(base, value))
/*@}*/

/*
 * MKV46F15 RCM
 *
 * Reset Control Module
 *
 * Registers defined in this header file:
 * - RCM_SRS0 - System Reset Status Register 0
 * - RCM_SRS1 - System Reset Status Register 1
 * - RCM_RPFC - Reset Pin Filter Control register
 * - RCM_RPFW - Reset Pin Filter Width register
 * - RCM_SSRS0 - Sticky System Reset Status Register 0
 * - RCM_SSRS1 - Sticky System Reset Status Register 1
 */

#define RCM_INSTANCE_COUNT (1U) /*!< Number of instances of the RCM module. */
#define RCM_IDX (0U) /*!< Instance number for RCM. */

/*******************************************************************************
 * RCM_SRS0 - System Reset Status Register 0
 ******************************************************************************/

/*!
 * @brief RCM_SRS0 - System Reset Status Register 0 (RO)
 *
 * Reset value: 0x82U
 *
 * This register includes read-only status flags to indicate the source of the
 * most recent reset. The reset state of these bits depends on what caused the MCU
 * to reset. The reset value of this register depends on the reset source: POR
 * (including LVD) - 0x82 LVD (without POR) - 0x02 VLLS mode wakeup due to RESET
 * pin assertion - 0x41 VLLS mode wakeup due to other wakeup sources - 0x01 Other
 * reset - a bit is set if its corresponding reset source caused the reset
 */
/*!
 * @name Constants and macros for entire RCM_SRS0 register
 */
/*@{*/
#define RCM_RD_SRS0(base)        (RCM_SRS0_REG(base))
/*@}*/

