theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the CMP field to a new value. */
#define SIM_WR_SCGC4_CMP(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_CMP_MASK, SIM_SCGC4_CMP(value)))
#define SIM_BWR_SCGC4_CMP(base, value) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_CMP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field eFlexPWM0[24] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 0.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_eFlexPWM0 field. */
#define SIM_RD_SCGC4_eFlexPWM0(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_eFlexPWM0_MASK) >> SIM_SCGC4_eFlexPWM0_SHIFT)
#define SIM_BRD_SCGC4_eFlexPWM0(base) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM0_SHIFT))

/*! @brief Set the eFlexPWM0 field to a new value. */
#define SIM_WR_SCGC4_eFlexPWM0(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_eFlexPWM0_MASK, SIM_SCGC4_eFlexPWM0(value)))
#define SIM_BWR_SCGC4_eFlexPWM0(base, value) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field eFlexPWM1[25] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 1.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_eFlexPWM1 field. */
#define SIM_RD_SCGC4_eFlexPWM1(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_eFlexPWM1_MASK) >> SIM_SCGC4_eFlexPWM1_SHIFT)
#define SIM_BRD_SCGC4_eFlexPWM1(base) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM1_SHIFT))

/*! @brief Set the eFlexPWM1 field to a new value. */
#define SIM_WR_SCGC4_eFlexPWM1(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_eFlexPWM1_MASK, SIM_SCGC4_eFlexPWM1(value)))
#define SIM_BWR_SCGC4_eFlexPWM1(base, value) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field eFlexPWM2[26] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 2.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_eFlexPWM2 field. */
#define SIM_RD_SCGC4_eFlexPWM2(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_eFlexPWM2_MASK) >> SIM_SCGC4_eFlexPWM2_SHIFT)
#define SIM_BRD_SCGC4_eFlexPWM2(base) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM2_SHIFT))

/*! @brief Set the eFlexPWM2 field to a new value. */
#define SIM_WR_SCGC4_eFlexPWM2(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_eFlexPWM2_MASK, SIM_SCGC4_eFlexPWM2(value)))
#define SIM_BWR_SCGC4_eFlexPWM2(base, value) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field eFlexPWM3[27] (RW)
 *
 * This bit controls the clock gate to the PWM submodule 3.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_eFlexPWM3 field. */
#define SIM_RD_SCGC4_eFlexPWM3(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_eFlexPWM3_MASK) >> SIM_SCGC4_eFlexPWM3_SHIFT)
#define SIM_BRD_SCGC4_eFlexPWM3(base) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM3_SHIFT))

/*! @brief Set the eFlexPWM3 field to a new value. */
#define SIM_WR_SCGC4_eFlexPWM3(base, value) (SIM_RMW_SCGC4(base, SIM_SCGC4_eFlexPWM3_MASK, SIM_SCGC4_eFlexPWM3(value)))
#define SIM_BWR_SCGC4_eFlexPWM3(base, value) (BITBAND_ACCESS32(&SIM_SCGC4_REG(base), SIM_SCGC4_eFlexPWM3_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SCGC5 - System Clock Gating Control Register 5
 ******************************************************************************/

/*!
 * @brief SIM_SCGC5 - System Clock Gating Control Register 5 (RW)
 *
 * Reset value: 0x00040182U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC5 register
 */
/*@{*/
#define SIM_RD_SCGC5(base)       (SIM_SCGC5_REG(base))
#define SIM_WR_SCGC5(base, value) (SIM_SCGC5_REG(base) = (value))
#define SIM_RMW_SCGC5(base, mask, value) (SIM_WR_SCGC5(base, (SIM_RD_SCGC5(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC5(base, value) (SIM_WR_SCGC5(base, SIM_RD_SCGC5(base) |  (value)))
#define SIM_CLR_SCGC5(base, value) (SIM_WR_SCGC5(base, SIM_RD_SCGC5(base) & ~(value)))
#define SIM_TOG_SCGC5(base, value) (SIM_WR_SCGC5(base, SIM_RD_SCGC5(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC5 bitfields
 */

/*!
 * @name Register SIM_SCGC5, field LPTMR[0] (RW)
 *
 * This bit controls software access to the Low Power Timer module.
 *
 * Values:
 * - 0 - Access disabled
 * - 1 - Access enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_LPTMR field. */
#define SIM_RD_SCGC5_LPTMR(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_LPTMR_MASK) >> SIM_SCGC5_LPTMR_SHIFT)
#define SIM_BRD_SCGC5_LPTMR(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_LPTMR_SHIFT))

/*! @brief Set the LPTMR field to a new value. */
#define SIM_WR_SCGC5_LPTMR(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_LPTMR_MASK, SIM_SCGC5_LPTMR(value)))
#define SIM_BWR_SCGC5_LPTMR(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_LPTMR_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTA[9] (RW)
 *
 * This bit controls the clock gate to the Port A module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTA field. */
#define SIM_RD_SCGC5_PORTA(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTA_MASK) >> SIM_SCGC5_PORTA_SHIFT)
#define SIM_BRD_SCGC5_PORTA(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTA_SHIFT))

/*! @brief Set the PORTA field to a new value. */
#define SIM_WR_SCGC5_PORTA(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTA_MASK, SIM_SCGC5_PORTA(value)))
#define SIM_BWR_SCGC5_PORTA(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTB[10] (RW)
 *
 * This bit controls the clock gate to the Port B module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTB field. */
#define SIM_RD_SCGC5_PORTB(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTB_MASK) >> SIM_SCGC5_PORTB_SHIFT)
#define SIM_BRD_SCGC5_PORTB(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTB_SHIFT))

/*! @brief Set the PORTB field to a new value. */
#define SIM_WR_SCGC5_PORTB(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTB_MASK, SIM_SCGC5_PORTB(value)))
#define SIM_BWR_SCGC5_PORTB(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTC[11] (RW)
 *
 * This bit controls the clock gate to the Port C module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTC field. */
#define SIM_RD_SCGC5_PORTC(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTC_MASK) >> SIM_SCGC5_PORTC_SHIFT)
#define SIM_BRD_SCGC5_PORTC(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTC_SHIFT))

