theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the PORTC field to a new value. */
#define SIM_WR_SCGC5_PORTC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTC_MASK, SIM_SCGC5_PORTC(value)))
#define SIM_BWR_SCGC5_PORTC(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTD[12] (RW)
 *
 * This bit controls the clock gate to the Port D module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTD field. */
#define SIM_RD_SCGC5_PORTD(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTD_MASK) >> SIM_SCGC5_PORTD_SHIFT)
#define SIM_BRD_SCGC5_PORTD(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTD_SHIFT))

/*! @brief Set the PORTD field to a new value. */
#define SIM_WR_SCGC5_PORTD(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTD_MASK, SIM_SCGC5_PORTD(value)))
#define SIM_BWR_SCGC5_PORTD(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTD_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTE[13] (RW)
 *
 * This bit controls the clock gate to the Port E module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_PORTE field. */
#define SIM_RD_SCGC5_PORTE(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_PORTE_MASK) >> SIM_SCGC5_PORTE_SHIFT)
#define SIM_BRD_SCGC5_PORTE(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTE_SHIFT))

/*! @brief Set the PORTE field to a new value. */
#define SIM_WR_SCGC5_PORTE(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_PORTE_MASK, SIM_SCGC5_PORTE(value)))
#define SIM_BWR_SCGC5_PORTE(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_PORTE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field ENC[21] (RW)
 *
 * This bit controls the clock gate to the ENC module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_ENC field. */
#define SIM_RD_SCGC5_ENC(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_ENC_MASK) >> SIM_SCGC5_ENC_SHIFT)
#define SIM_BRD_SCGC5_ENC(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_ENC_SHIFT))

/*! @brief Set the ENC field to a new value. */
#define SIM_WR_SCGC5_ENC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_ENC_MASK, SIM_SCGC5_ENC(value)))
#define SIM_BWR_SCGC5_ENC(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_ENC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field XBARA[25] (RW)
 *
 * This bit controls the clock gate to the XBARA module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_XBARA field. */
#define SIM_RD_SCGC5_XBARA(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_XBARA_MASK) >> SIM_SCGC5_XBARA_SHIFT)
#define SIM_BRD_SCGC5_XBARA(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_XBARA_SHIFT))

/*! @brief Set the XBARA field to a new value. */
#define SIM_WR_SCGC5_XBARA(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_XBARA_MASK, SIM_SCGC5_XBARA(value)))
#define SIM_BWR_SCGC5_XBARA(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_XBARA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field XBARB[26] (RW)
 *
 * This bit controls the clock gate to the XBARB module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_XBARB field. */
#define SIM_RD_SCGC5_XBARB(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_XBARB_MASK) >> SIM_SCGC5_XBARB_SHIFT)
#define SIM_BRD_SCGC5_XBARB(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_XBARB_SHIFT))

/*! @brief Set the XBARB field to a new value. */
#define SIM_WR_SCGC5_XBARB(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_XBARB_MASK, SIM_SCGC5_XBARB(value)))
#define SIM_BWR_SCGC5_XBARB(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_XBARB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field AOI[27] (RW)
 *
 * This bit controls the clock gate to the AOI module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_AOI field. */
#define SIM_RD_SCGC5_AOI(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_AOI_MASK) >> SIM_SCGC5_AOI_SHIFT)
#define SIM_BRD_SCGC5_AOI(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_AOI_SHIFT))

/*! @brief Set the AOI field to a new value. */
#define SIM_WR_SCGC5_AOI(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_AOI_MASK, SIM_SCGC5_AOI(value)))
#define SIM_BWR_SCGC5_AOI(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_AOI_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field ADC[28] (RW)
 *
 * This bit controls the clock gate to the ADC module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC5_ADC field. */
#define SIM_RD_SCGC5_ADC(base) ((SIM_SCGC5_REG(base) & SIM_SCGC5_ADC_MASK) >> SIM_SCGC5_ADC_SHIFT)
#define SIM_BRD_SCGC5_ADC(base) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_ADC_SHIFT))

/*! @brief Set the ADC field to a new value. */
#define SIM_WR_SCGC5_ADC(base, value) (SIM_RMW_SCGC5(base, SIM_SCGC5_ADC_MASK, SIM_SCGC5_ADC(value)))
#define SIM_BWR_SCGC5_ADC(base, value) (BITBAND_ACCESS32(&SIM_SCGC5_REG(base), SIM_SCGC5_ADC_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_SCGC6 - System Clock Gating Control Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SCGC6 - System Clock Gating Control Register 6 (RW)
 *
 * Reset value: 0x00000001U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC6 register
 */
/*@{*/
#define SIM_RD_SCGC6(base)       (SIM_SCGC6_REG(base))
#define SIM_WR_SCGC6(base, value) (SIM_SCGC6_REG(base) = (value))
#define SIM_RMW_SCGC6(base, mask, value) (SIM_WR_SCGC6(base, (SIM_RD_SCGC6(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) |  (value)))
#define SIM_CLR_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) & ~(value)))
#define SIM_TOG_SCGC6(base, value) (SIM_WR_SCGC6(base, SIM_RD_SCGC6(base) ^  (value)))
/*@}*/

