theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * SIM_UIDL - Unique Identification Register Low
 ******************************************************************************/

/*!
 * @brief SIM_UIDL - Unique Identification Register Low (ROWU)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UIDL register
 */
/*@{*/
#define SIM_RD_UIDL(base)        (SIM_UIDL_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_CLKDIV4 - System Clock Divider Register 4
 ******************************************************************************/

/*!
 * @brief SIM_CLKDIV4 - System Clock Divider Register 4 (RW)
 *
 * Reset value: 0x10000000U
 */
/*!
 * @name Constants and macros for entire SIM_CLKDIV4 register
 */
/*@{*/
#define SIM_RD_CLKDIV4(base)     (SIM_CLKDIV4_REG(base))
#define SIM_WR_CLKDIV4(base, value) (SIM_CLKDIV4_REG(base) = (value))
#define SIM_RMW_CLKDIV4(base, mask, value) (SIM_WR_CLKDIV4(base, (SIM_RD_CLKDIV4(base) & ~(mask)) | (value)))
#define SIM_SET_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) |  (value)))
#define SIM_CLR_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) & ~(value)))
#define SIM_TOG_CLKDIV4(base, value) (SIM_WR_CLKDIV4(base, SIM_RD_CLKDIV4(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_CLKDIV4 bitfields
 */

/*!
 * @name Register SIM_CLKDIV4, field TRACEFRAC[0] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the fractional clock divider is
 * set by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock*((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEFRAC field. */
#define SIM_RD_CLKDIV4_TRACEFRAC(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEFRAC_MASK) >> SIM_CLKDIV4_TRACEFRAC_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEFRAC(base) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT))

/*! @brief Set the TRACEFRAC field to a new value. */
#define SIM_WR_CLKDIV4_TRACEFRAC(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEFRAC_MASK, SIM_CLKDIV4_TRACEFRAC(value)))
#define SIM_BWR_CLKDIV4_TRACEFRAC(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEFRAC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIV[3:1] (RW)
 *
 * This field sets the divide value for the fractional clock divider used as a
 * source for trace clock. The source clock for the fractional clock divider is
 * set by the SOPT2 TRACECLKSEL register bit. Divider output clock = Divider input
 * clock * ((TRACEFRAC+1)/(TRACEDIV+1))
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIV field. */
#define SIM_RD_CLKDIV4_TRACEDIV(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIV_MASK) >> SIM_CLKDIV4_TRACEDIV_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIV(base) (SIM_RD_CLKDIV4_TRACEDIV(base))

/*! @brief Set the TRACEDIV field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIV(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIV_MASK, SIM_CLKDIV4_TRACEDIV(value)))
#define SIM_BWR_CLKDIV4_TRACEDIV(base, value) (SIM_WR_CLKDIV4_TRACEDIV(base, value))
/*@}*/

/*!
 * @name Register SIM_CLKDIV4, field TRACEDIVEN[28] (RW)
 *
 * This bit controls the Debug Trace Divider.
 *
 * Values:
 * - 0 - Debug trace divider disabled
 * - 1 - Debug trace divider enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_CLKDIV4_TRACEDIVEN field. */
#define SIM_RD_CLKDIV4_TRACEDIVEN(base) ((SIM_CLKDIV4_REG(base) & SIM_CLKDIV4_TRACEDIVEN_MASK) >> SIM_CLKDIV4_TRACEDIVEN_SHIFT)
#define SIM_BRD_CLKDIV4_TRACEDIVEN(base) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIVEN_SHIFT))

/*! @brief Set the TRACEDIVEN field to a new value. */
#define SIM_WR_CLKDIV4_TRACEDIVEN(base, value) (SIM_RMW_CLKDIV4(base, SIM_CLKDIV4_TRACEDIVEN_MASK, SIM_CLKDIV4_TRACEDIVEN(value)))
#define SIM_BWR_CLKDIV4_TRACEDIVEN(base, value) (BITBAND_ACCESS32(&SIM_CLKDIV4_REG(base), SIM_CLKDIV4_TRACEDIVEN_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * SIM_MISCTRL - Miscellaneous Control Register
 ******************************************************************************/

/*!
 * @brief SIM_MISCTRL - Miscellaneous Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MISCTRL register
 */
/*@{*/
#define SIM_RD_MISCTRL(base)     (SIM_MISCTRL_REG(base))
#define SIM_WR_MISCTRL(base, value) (SIM_MISCTRL_REG(base) = (value))
#define SIM_RMW_MISCTRL(base, mask, value) (SIM_WR_MISCTRL(base, (SIM_RD_MISCTRL(base) & ~(mask)) | (value)))
#define SIM_SET_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) |  (value)))
#define SIM_CLR_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) & ~(value)))
#define SIM_TOG_MISCTRL(base, value) (SIM_WR_MISCTRL(base, SIM_RD_MISCTRL(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISCTRL bitfields
 */

/*!
 * @name Register SIM_MISCTRL, field CMPWIN0SRC[9:8] (RW)
 *
 * Values:
 * - 00 - XBARA output 16.
 * - 01 - CMP0 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 0.
 * - 10 - PDB0 pluse-out channel 0.
 * - 11 - PDB1 pluse-out channel 0.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_CMPWIN0SRC field. */
#define SIM_RD_MISCTRL_CMPWIN0SRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_CMPWIN0SRC_MASK) >> SIM_MISCTRL_CMPWIN0SRC_SHIFT)
#define SIM_BRD_MISCTRL_CMPWIN0SRC(base) (SIM_RD_MISCTRL_CMPWIN0SRC(base))

/*! @brief Set the CMPWIN0SRC field to a new value. */
#define SIM_WR_MISCTRL_CMPWIN0SRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_CMPWIN0SRC_MASK, SIM_MISCTRL_CMPWIN0SRC(value)))
#define SIM_BWR_MISCTRL_CMPWIN0SRC(base, value) (SIM_WR_MISCTRL_CMPWIN0SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL, field CMPWIN1SRC[11:10] (RW)
 *
 * Values:
 * - 00 - XBARA output 17.
 * - 01 - CMP1 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 1.
 * - 10 - PDB0 pluse-out channel 1.
 * - 11 - PDB1 pluse-out channel 1.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_CMPWIN1SRC field. */
#define SIM_RD_MISCTRL_CMPWIN1SRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_CMPWIN1SRC_MASK) >> SIM_MISCTRL_CMPWIN1SRC_SHIFT)
#define SIM_BRD_MISCTRL_CMPWIN1SRC(base) (SIM_RD_MISCTRL_CMPWIN1SRC(base))

/*! @brief Set the CMPWIN1SRC field to a new value. */
#define SIM_WR_MISCTRL_CMPWIN1SRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_CMPWIN1SRC_MASK, SIM_MISCTRL_CMPWIN1SRC(value)))
#define SIM_BWR_MISCTRL_CMPWIN1SRC(base, value) (SIM_WR_MISCTRL_CMPWIN1SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL, field CMPWIN2SRC[13:12] (RW)
 *
 * Values:
 * - 00 - XBARA output 18.
 * - 01 - CMP2 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 2.
 * - 10 - PDB0 pluse-out channel 2.
 * - 11 - PDB1 pluse-out channel 2.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_CMPWIN2SRC field. */
#define SIM_RD_MISCTRL_CMPWIN2SRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_CMPWIN2SRC_MASK) >> SIM_MISCTRL_CMPWIN2SRC_SHIFT)
#define SIM_BRD_MISCTRL_CMPWIN2SRC(base) (SIM_RD_MISCTRL_CMPWIN2SRC(base))

/*! @brief Set the CMPWIN2SRC field to a new value. */
#define SIM_WR_MISCTRL_CMPWIN2SRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_CMPWIN2SRC_MASK, SIM_MISCTRL_CMPWIN2SRC(value)))
#define SIM_BWR_MISCTRL_CMPWIN2SRC(base, value) (SIM_WR_MISCTRL_CMPWIN2SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL, field CMPWIN3SRC[15:14] (RW)
 *
 * Values:
 * - 00 - XBARA output 19.
 * - 01 - CMP3 Sample/Window input is driven by both PDB0 and PDB1 pluse-out
 *     channel 3.
 * - 10 - PDB0 pluse-out channel 3.
 * - 11 - PDB1 pluse-out channel 3.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_CMPWIN3SRC field. */
#define SIM_RD_MISCTRL_CMPWIN3SRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_CMPWIN3SRC_MASK) >> SIM_MISCTRL_CMPWIN3SRC_SHIFT)
#define SIM_BRD_MISCTRL_CMPWIN3SRC(base) (SIM_RD_MISCTRL_CMPWIN3SRC(base))

/*! @brief Set the CMPWIN3SRC field to a new value. */
#define SIM_WR_MISCTRL_CMPWIN3SRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_CMPWIN3SRC_MASK, SIM_MISCTRL_CMPWIN3SRC(value)))
#define SIM_BWR_MISCTRL_CMPWIN3SRC(base, value) (SIM_WR_MISCTRL_CMPWIN3SRC(base, value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL, field EWMINSRC[16] (RW)
 *
 * This bit controls the ewm_in source of EWM module.
 *
 * Values:
 * - 0 - XBARA output 58.
 * - 1 - EWM_IN pin
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_EWMINSRC field. */
#define SIM_RD_MISCTRL_EWMINSRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_EWMINSRC_MASK) >> SIM_MISCTRL_EWMINSRC_SHIFT)
#define SIM_BRD_MISCTRL_EWMINSRC(base) (BITBAND_ACCESS32(&SIM_MISCTRL_REG(base), SIM_MISCTRL_EWMINSRC_SHIFT))

/*! @brief Set the EWMINSRC field to a new value. */
#define SIM_WR_MISCTRL_EWMINSRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_EWMINSRC_MASK, SIM_MISCTRL_EWMINSRC(value)))
#define SIM_BWR_MISCTRL_EWMINSRC(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL_REG(base), SIM_MISCTRL_EWMINSRC_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL, field DACTRIGSRC[19:18] (RW)
 *
 * Values:
 * - 00 - XBARA output 15.
 * - 01 - DAC0 can be triggered by both PDB0 interval trigger 0 and PDB1
 *     interval trigger 0.
 * - 10 - PDB0 interval trigger 0
 * - 11 - PDB1 interval trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL_DACTRIGSRC field. */
#define SIM_RD_MISCTRL_DACTRIGSRC(base) ((SIM_MISCTRL_REG(base) & SIM_MISCTRL_DACTRIGSRC_MASK) >> SIM_MISCTRL_DACTRIGSRC_SHIFT)
#define SIM_BRD_MISCTRL_DACTRIGSRC(base) (SIM_RD_MISCTRL_DACTRIGSRC(base))

/*! @brief Set the DACTRIGSRC field to a new value. */
#define SIM_WR_MISCTRL_DACTRIGSRC(base, value) (SIM_RMW_MISCTRL(base, SIM_MISCTRL_DACTRIGSRC_MASK, SIM_MISCTRL_DACTRIGSRC(value)))
#define SIM_BWR_MISCTRL_DACTRIGSRC(base, value) (SIM_WR_MISCTRL_DACTRIGSRC(base, value))
/*@}*/

