theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*******************************************************************************
 * SIM_ADCOPT - ADC Channel 6/7 Mux Control Register
 ******************************************************************************/

/*!
 * @brief SIM_ADCOPT - ADC Channel 6/7 Mux Control Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_ADCOPT register
 */
/*@{*/
#define SIM_RD_ADCOPT(base)      (SIM_ADCOPT_REG(base))
#define SIM_WR_ADCOPT(base, value) (SIM_ADCOPT_REG(base) = (value))
#define SIM_RMW_ADCOPT(base, mask, value) (SIM_WR_ADCOPT(base, (SIM_RD_ADCOPT(base) & ~(mask)) | (value)))
#define SIM_SET_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) |  (value)))
#define SIM_CLR_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) & ~(value)))
#define SIM_TOG_ADCOPT(base, value) (SIM_WR_ADCOPT(base, SIM_RD_ADCOPT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_ADCOPT bitfields
 */

/*!
 * @name Register SIM_ADCOPT, field ADCACH6SEL[2:0] (RW)
 *
 * Selects ADCA MUX0's channel to ADCA channel 6.
 *
 * Values:
 * - 000 - ADCA MUX0's channel a.
 * - 001 - ADCA MUX0's channel b.
 * - 010 - ADCA MUX0's channel c.
 * - 011 - ADCA MUX0's channel d.
 * - 100 - ADCA MUX0's channel e.
 * - 101 - Reserved
 * - 110 - ADCA MUX0's channel g.
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCACH6SEL field. */
#define SIM_RD_ADCOPT_ADCACH6SEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCACH6SEL_MASK) >> SIM_ADCOPT_ADCACH6SEL_SHIFT)
#define SIM_BRD_ADCOPT_ADCACH6SEL(base) (SIM_RD_ADCOPT_ADCACH6SEL(base))

/*! @brief Set the ADCACH6SEL field to a new value. */
#define SIM_WR_ADCOPT_ADCACH6SEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADCACH6SEL_MASK, SIM_ADCOPT_ADCACH6SEL(value)))
#define SIM_BWR_ADCOPT_ADCACH6SEL(base, value) (SIM_WR_ADCOPT_ADCACH6SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCACH7SEL[6:4] (RW)
 *
 * Selects ADCA MUX1's channel to ADCA channel 7.
 *
 * Values:
 * - 000 - ADCA MUX1's channel a.
 * - 001 - ADCA MUX1's channel b.
 * - 010 - ADCA MUX1's channel c.
 * - 011 - Reserved
 * - 100 - ADCA MUX1's channel e.
 * - 101 - ADCA MUX1's channel f.
 * - 110 - ADCA MUX1's channel g.
 * - 111 - PMC 1V
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCACH7SEL field. */
#define SIM_RD_ADCOPT_ADCACH7SEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCACH7SEL_MASK) >> SIM_ADCOPT_ADCACH7SEL_SHIFT)
#define SIM_BRD_ADCOPT_ADCACH7SEL(base) (SIM_RD_ADCOPT_ADCACH7SEL(base))

/*! @brief Set the ADCACH7SEL field to a new value. */
#define SIM_WR_ADCOPT_ADCACH7SEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADCACH7SEL_MASK, SIM_ADCOPT_ADCACH7SEL(value)))
#define SIM_BWR_ADCOPT_ADCACH7SEL(base, value) (SIM_WR_ADCOPT_ADCACH7SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCBCH6SEL[10:8] (RW)
 *
 * Selects ADCB MUX0's channel to ADCB channel 6.
 *
 * Values:
 * - 000 - ADCB MUX0's channel a.
 * - 001 - ADCB MUX0's channel b.
 * - 010 - ADCB MUX0's channel c.
 * - 011 - ADCB MUX0's channel d.
 * - 100 - ADCB MUX0's channel e.
 * - 101 - ADCB MUX0's channel f.
 * - 110 - ADCB MUX0's channel g.
 * - 111 - PMC 1V.
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCBCH6SEL field. */
#define SIM_RD_ADCOPT_ADCBCH6SEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCBCH6SEL_MASK) >> SIM_ADCOPT_ADCBCH6SEL_SHIFT)
#define SIM_BRD_ADCOPT_ADCBCH6SEL(base) (SIM_RD_ADCOPT_ADCBCH6SEL(base))

/*! @brief Set the ADCBCH6SEL field to a new value. */
#define SIM_WR_ADCOPT_ADCBCH6SEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADCBCH6SEL_MASK, SIM_ADCOPT_ADCBCH6SEL(value)))
#define SIM_BWR_ADCOPT_ADCBCH6SEL(base, value) (SIM_WR_ADCOPT_ADCBCH6SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCBCH7SEL[14:12] (RW)
 *
 * Selects ADCB MUX1's channel to ADCB channel 7.
 *
 * Values:
 * - 000 - ADCB MUX1's channel a.
 * - 001 - ADCB MUX1's channel b.
 * - 010 - ADCB MUX1's channel c.
 * - 011 - ADCB MUX1's channel d.
 * - 100 - ADCB MUX1's channel e.
 * - 101 - ADCB MUX1's channel f.
 * - 110 - ADCB MUX1's channel g.
 * - 111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCBCH7SEL field. */
#define SIM_RD_ADCOPT_ADCBCH7SEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCBCH7SEL_MASK) >> SIM_ADCOPT_ADCBCH7SEL_SHIFT)
#define SIM_BRD_ADCOPT_ADCBCH7SEL(base) (SIM_RD_ADCOPT_ADCBCH7SEL(base))

/*! @brief Set the ADCBCH7SEL field to a new value. */
#define SIM_WR_ADCOPT_ADCBCH7SEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADCBCH7SEL_MASK, SIM_ADCOPT_ADCBCH7SEL(value)))
#define SIM_BWR_ADCOPT_ADCBCH7SEL(base, value) (SIM_WR_ADCOPT_ADCBCH7SEL(base, value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ROSB[24] (RW)
 *
 * Control ADC low current mode in STOP and VLPS mode.
 *
 * Values:
 * - 0 - Disable ADC low current mode.
 * - 1 - Enable ADC low current mode.
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ROSB field. */
#define SIM_RD_ADCOPT_ROSB(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ROSB_MASK) >> SIM_ADCOPT_ROSB_SHIFT)
#define SIM_BRD_ADCOPT_ROSB(base) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ROSB_SHIFT))

/*! @brief Set the ROSB field to a new value. */
#define SIM_WR_ADCOPT_ROSB(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ROSB_MASK, SIM_ADCOPT_ROSB(value)))
#define SIM_BWR_ADCOPT_ROSB(base, value) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ROSB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCIRCLK[25] (RO)
 *
 * Indicates which clock is fed in ADC. Can't access ADC's registers when this
 * bit is "1". This bit is used in STOP/VLPS mode to make sure if the ADC clock is
 * switched to the expected clock.
 *
 * Values:
 * - 0 - ADC clock is fast peripherial clock.
 * - 1 - ADC clock is MCGIRCLK.
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCIRCLK field. */
#define SIM_RD_ADCOPT_ADCIRCLK(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCIRCLK_MASK) >> SIM_ADCOPT_ADCIRCLK_SHIFT)
#define SIM_BRD_ADCOPT_ADCIRCLK(base) (BITBAND_ACCESS32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADCIRCLK_SHIFT))
/*@}*/

