theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the SEL32 field to a new value. */
#define XBARA_WR_SEL16_SEL32(base, value) (XBARA_RMW_SEL16(base, XBARA_SEL16_SEL32_MASK, XBARA_SEL16_SEL32(value)))
#define XBARA_BWR_SEL16_SEL32(base, value) (XBARA_WR_SEL16_SEL32(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL16, field SEL33[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT33 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL16_SEL33 field. */
#define XBARA_RD_SEL16_SEL33(base) ((XBARA_SEL16_REG(base) & XBARA_SEL16_SEL33_MASK) >> XBARA_SEL16_SEL33_SHIFT)
#define XBARA_BRD_SEL16_SEL33(base) (XBARA_RD_SEL16_SEL33(base))

/*! @brief Set the SEL33 field to a new value. */
#define XBARA_WR_SEL16_SEL33(base, value) (XBARA_RMW_SEL16(base, XBARA_SEL16_SEL33_MASK, XBARA_SEL16_SEL33(value)))
#define XBARA_BWR_SEL16_SEL33(base, value) (XBARA_WR_SEL16_SEL33(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL17 - Crossbar A Select Register 17
 ******************************************************************************/

/*!
 * @brief XBARA_SEL17 - Crossbar A Select Register 17 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL17 register
 */
/*@{*/
#define XBARA_RD_SEL17(base)     (XBARA_SEL17_REG(base))
#define XBARA_WR_SEL17(base, value) (XBARA_SEL17_REG(base) = (value))
#define XBARA_RMW_SEL17(base, mask, value) (XBARA_WR_SEL17(base, (XBARA_RD_SEL17(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL17(base, value) (XBARA_WR_SEL17(base, XBARA_RD_SEL17(base) |  (value)))
#define XBARA_CLR_SEL17(base, value) (XBARA_WR_SEL17(base, XBARA_RD_SEL17(base) & ~(value)))
#define XBARA_TOG_SEL17(base, value) (XBARA_WR_SEL17(base, XBARA_RD_SEL17(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL17 bitfields
 */

/*!
 * @name Register XBARA_SEL17, field SEL34[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT34 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL17_SEL34 field. */
#define XBARA_RD_SEL17_SEL34(base) ((XBARA_SEL17_REG(base) & XBARA_SEL17_SEL34_MASK) >> XBARA_SEL17_SEL34_SHIFT)
#define XBARA_BRD_SEL17_SEL34(base) (XBARA_RD_SEL17_SEL34(base))

/*! @brief Set the SEL34 field to a new value. */
#define XBARA_WR_SEL17_SEL34(base, value) (XBARA_RMW_SEL17(base, XBARA_SEL17_SEL34_MASK, XBARA_SEL17_SEL34(value)))
#define XBARA_BWR_SEL17_SEL34(base, value) (XBARA_WR_SEL17_SEL34(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL17, field SEL35[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT35 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL17_SEL35 field. */
#define XBARA_RD_SEL17_SEL35(base) ((XBARA_SEL17_REG(base) & XBARA_SEL17_SEL35_MASK) >> XBARA_SEL17_SEL35_SHIFT)
#define XBARA_BRD_SEL17_SEL35(base) (XBARA_RD_SEL17_SEL35(base))

/*! @brief Set the SEL35 field to a new value. */
#define XBARA_WR_SEL17_SEL35(base, value) (XBARA_RMW_SEL17(base, XBARA_SEL17_SEL35_MASK, XBARA_SEL17_SEL35(value)))
#define XBARA_BWR_SEL17_SEL35(base, value) (XBARA_WR_SEL17_SEL35(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL18 - Crossbar A Select Register 18
 ******************************************************************************/

/*!
 * @brief XBARA_SEL18 - Crossbar A Select Register 18 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL18 register
 */
/*@{*/
#define XBARA_RD_SEL18(base)     (XBARA_SEL18_REG(base))
#define XBARA_WR_SEL18(base, value) (XBARA_SEL18_REG(base) = (value))
#define XBARA_RMW_SEL18(base, mask, value) (XBARA_WR_SEL18(base, (XBARA_RD_SEL18(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL18(base, value) (XBARA_WR_SEL18(base, XBARA_RD_SEL18(base) |  (value)))
#define XBARA_CLR_SEL18(base, value) (XBARA_WR_SEL18(base, XBARA_RD_SEL18(base) & ~(value)))
#define XBARA_TOG_SEL18(base, value) (XBARA_WR_SEL18(base, XBARA_RD_SEL18(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL18 bitfields
 */

/*!
 * @name Register XBARA_SEL18, field SEL36[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT36 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL18_SEL36 field. */
#define XBARA_RD_SEL18_SEL36(base) ((XBARA_SEL18_REG(base) & XBARA_SEL18_SEL36_MASK) >> XBARA_SEL18_SEL36_SHIFT)
#define XBARA_BRD_SEL18_SEL36(base) (XBARA_RD_SEL18_SEL36(base))

/*! @brief Set the SEL36 field to a new value. */
#define XBARA_WR_SEL18_SEL36(base, value) (XBARA_RMW_SEL18(base, XBARA_SEL18_SEL36_MASK, XBARA_SEL18_SEL36(value)))
#define XBARA_BWR_SEL18_SEL36(base, value) (XBARA_WR_SEL18_SEL36(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL18, field SEL37[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT37 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL18_SEL37 field. */
#define XBARA_RD_SEL18_SEL37(base) ((XBARA_SEL18_REG(base) & XBARA_SEL18_SEL37_MASK) >> XBARA_SEL18_SEL37_SHIFT)
#define XBARA_BRD_SEL18_SEL37(base) (XBARA_RD_SEL18_SEL37(base))

/*! @brief Set the SEL37 field to a new value. */
#define XBARA_WR_SEL18_SEL37(base, value) (XBARA_RMW_SEL18(base, XBARA_SEL18_SEL37_MASK, XBARA_SEL18_SEL37(value)))
#define XBARA_BWR_SEL18_SEL37(base, value) (XBARA_WR_SEL18_SEL37(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL19 - Crossbar A Select Register 19
 ******************************************************************************/

/*!
 * @brief XBARA_SEL19 - Crossbar A Select Register 19 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL19 register
 */
/*@{*/
#define XBARA_RD_SEL19(base)     (XBARA_SEL19_REG(base))
#define XBARA_WR_SEL19(base, value) (XBARA_SEL19_REG(base) = (value))
#define XBARA_RMW_SEL19(base, mask, value) (XBARA_WR_SEL19(base, (XBARA_RD_SEL19(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL19(base, value) (XBARA_WR_SEL19(base, XBARA_RD_SEL19(base) |  (value)))
#define XBARA_CLR_SEL19(base, value) (XBARA_WR_SEL19(base, XBARA_RD_SEL19(base) & ~(value)))
#define XBARA_TOG_SEL19(base, value) (XBARA_WR_SEL19(base, XBARA_RD_SEL19(base) ^  (value)))
/*@}*/

