theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the DEN0 field to a new value. */
#define XBARA_WR_CTRL0_DEN0(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_DEN0_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_DEN0(value)))
#define XBARA_BWR_CTRL0_DEN0(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_DEN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field IEN0[1] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT0
 * output. When the interrupt is enabled, the output INT_REQ0 reflects the value STS0.
 * When the interrupt is disabled, INT_REQ0 remains low. The interrupt request is
 * cleared by writing a 1 to STS0. IEN0 and DEN0 should not both be set to 1.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_IEN0 field. */
#define XBARA_RD_CTRL0_IEN0(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_IEN0_MASK) >> XBARA_CTRL0_IEN0_SHIFT)
#define XBARA_BRD_CTRL0_IEN0(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_IEN0_SHIFT))

/*! @brief Set the IEN0 field to a new value. */
#define XBARA_WR_CTRL0_IEN0(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_IEN0_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_IEN0(value)))
#define XBARA_BWR_CTRL0_IEN0(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_IEN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field EDGE0[3:2] (RW)
 *
 * This field selects which edges on XBAR_OUT0 cause STS0 to assert.
 *
 * Values:
 * - 00 - STS0 never asserts
 * - 01 - STS0 asserts on rising edges of XBAR_OUT0
 * - 10 - STS0 asserts on falling edges of XBAR_OUT0
 * - 11 - STS0 asserts on rising and falling edges of XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_EDGE0 field. */
#define XBARA_RD_CTRL0_EDGE0(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_EDGE0_MASK) >> XBARA_CTRL0_EDGE0_SHIFT)
#define XBARA_BRD_CTRL0_EDGE0(base) (XBARA_RD_CTRL0_EDGE0(base))

/*! @brief Set the EDGE0 field to a new value. */
#define XBARA_WR_CTRL0_EDGE0(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_EDGE0_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_EDGE0(value)))
#define XBARA_BWR_CTRL0_EDGE0(base, value) (XBARA_WR_CTRL0_EDGE0(base, value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field STS0[4] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT0. This field is
 * set to 1 when an edge consistent with the current setting of EDGE0 is detected
 * on XBAR_OUT0. This field is cleared by writing 1 to it or by a DMA_ACK0
 * reception when DEN0 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT0, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0 - Active edge not yet detected on XBAR_OUT0
 * - 1 - Active edge detected on XBAR_OUT0
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_STS0 field. */
#define XBARA_RD_CTRL0_STS0(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_STS0_MASK) >> XBARA_CTRL0_STS0_SHIFT)
#define XBARA_BRD_CTRL0_STS0(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_STS0_SHIFT))

/*! @brief Set the STS0 field to a new value. */
#define XBARA_WR_CTRL0_STS0(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_STS0(value)))
#define XBARA_BWR_CTRL0_STS0(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_STS0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field DEN1[8] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT1 output. When
 * enabled, DMA_REQ1 presents the value STS1. When disabled, the DMA_REQ1 output
 * remains low. IEN1 and DEN1 should not both be set to 1.
 *
 * Values:
 * - 0 - DMA disabled
 * - 1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_DEN1 field. */
#define XBARA_RD_CTRL0_DEN1(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_DEN1_MASK) >> XBARA_CTRL0_DEN1_SHIFT)
#define XBARA_BRD_CTRL0_DEN1(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_DEN1_SHIFT))

/*! @brief Set the DEN1 field to a new value. */
#define XBARA_WR_CTRL0_DEN1(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_DEN1_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_DEN1(value)))
#define XBARA_BWR_CTRL0_DEN1(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_DEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field IEN1[9] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT1
 * output. When the interrupt is enabled, the output INT_REQ1 reflects the value STS1.
 * When the interrupt is disabled, INT_REQ1 remains low. The interrupt request is
 * cleared by writing a 1 to STS1. IEN1 and DEN1 should not both be set to 1.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_IEN1 field. */
#define XBARA_RD_CTRL0_IEN1(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_IEN1_MASK) >> XBARA_CTRL0_IEN1_SHIFT)
#define XBARA_BRD_CTRL0_IEN1(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_IEN1_SHIFT))

/*! @brief Set the IEN1 field to a new value. */
#define XBARA_WR_CTRL0_IEN1(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_IEN1_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_IEN1(value)))
#define XBARA_BWR_CTRL0_IEN1(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_IEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field EDGE1[11:10] (RW)
 *
 * This field selects which edges on XBAR_OUT1 cause STS1 to assert.
 *
 * Values:
 * - 00 - STS1 never asserts
 * - 01 - STS1 asserts on rising edges of XBAR_OUT1
 * - 10 - STS1 asserts on falling edges of XBAR_OUT1
 * - 11 - STS1 asserts on rising and falling edges of XBAR_OUT1
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_EDGE1 field. */
#define XBARA_RD_CTRL0_EDGE1(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_EDGE1_MASK) >> XBARA_CTRL0_EDGE1_SHIFT)
#define XBARA_BRD_CTRL0_EDGE1(base) (XBARA_RD_CTRL0_EDGE1(base))

