theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_extension.h
/*! @brief Set the EDGE1 field to a new value. */
#define XBARA_WR_CTRL0_EDGE1(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_EDGE1_MASK | XBARA_CTRL0_STS0_MASK | XBARA_CTRL0_STS1_MASK), XBARA_CTRL0_EDGE1(value)))
#define XBARA_BWR_CTRL0_EDGE1(base, value) (XBARA_WR_CTRL0_EDGE1(base, value))
/*@}*/

/*!
 * @name Register XBARA_CTRL0, field STS1[12] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT1. This field is
 * set to 1 when an edge consistent with the current setting of EDGE1 is detected
 * on XBAR_OUT1. This field is cleared by writing 1 to it or by a DMA_ACK1
 * reception when DEN1 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT1, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0 - Active edge not yet detected on XBAR_OUT1
 * - 1 - Active edge detected on XBAR_OUT1
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL0_STS1 field. */
#define XBARA_RD_CTRL0_STS1(base) ((XBARA_CTRL0_REG(base) & XBARA_CTRL0_STS1_MASK) >> XBARA_CTRL0_STS1_SHIFT)
#define XBARA_BRD_CTRL0_STS1(base) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_STS1_SHIFT))

/*! @brief Set the STS1 field to a new value. */
#define XBARA_WR_CTRL0_STS1(base, value) (XBARA_RMW_CTRL0(base, (XBARA_CTRL0_STS1_MASK | XBARA_CTRL0_STS0_MASK), XBARA_CTRL0_STS1(value)))
#define XBARA_BWR_CTRL0_STS1(base, value) (BITBAND_ACCESS16(&XBARA_CTRL0_REG(base), XBARA_CTRL0_STS1_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * XBARA_CTRL1 - Crossbar A Control Register 1
 ******************************************************************************/

/*!
 * @brief XBARA_CTRL1 - Crossbar A Control Register 1 (RW)
 *
 * Reset value: 0x0000U
 *
 * Use this register to configure edge detection, interrupt, and DMA features
 * for the XBAR_OUT2 and XBAR_OUT3 outputs. The XBAR_CTRL registers are organized
 * similarly to the XBAR_SEL registers, with control fields for two XBAR_OUT
 * outputs in each register. In control register 1, the LSBs contain the control
 * fields for XBAR_OUT2, and the MSBs contain the control fields for XBAR_OUT3.
 */
/*!
 * @name Constants and macros for entire XBARA_CTRL1 register
 */
/*@{*/
#define XBARA_RD_CTRL1(base)     (XBARA_CTRL1_REG(base))
#define XBARA_WR_CTRL1(base, value) (XBARA_CTRL1_REG(base) = (value))
#define XBARA_RMW_CTRL1(base, mask, value) (XBARA_WR_CTRL1(base, (XBARA_RD_CTRL1(base) & ~(mask)) | (value)))
#define XBARA_SET_CTRL1(base, value) (XBARA_WR_CTRL1(base, XBARA_RD_CTRL1(base) |  (value)))
#define XBARA_CLR_CTRL1(base, value) (XBARA_WR_CTRL1(base, XBARA_RD_CTRL1(base) & ~(value)))
#define XBARA_TOG_CTRL1(base, value) (XBARA_WR_CTRL1(base, XBARA_RD_CTRL1(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_CTRL1 bitfields
 */

/*!
 * @name Register XBARA_CTRL1, field DEN2[0] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT2 output. When
 * enabled, DMA_REQ2 presents the value STS2. When disabled, the DMA_REQ2 output
 * remains low. IEN2 and DEN2 should not both be set to 1.
 *
 * Values:
 * - 0 - DMA disabled
 * - 1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_DEN2 field. */
#define XBARA_RD_CTRL1_DEN2(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_DEN2_MASK) >> XBARA_CTRL1_DEN2_SHIFT)
#define XBARA_BRD_CTRL1_DEN2(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_DEN2_SHIFT))

/*! @brief Set the DEN2 field to a new value. */
#define XBARA_WR_CTRL1_DEN2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_DEN2_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_DEN2(value)))
#define XBARA_BWR_CTRL1_DEN2(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_DEN2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field IEN2[1] (RW)
 *
 * This bit enables the interrupt function on the corresponding XBAR_OUT2
 * output. When the interrupt is enabled, the output INT_REQ2 reflects the value STS2.
 * When the interrupt is disabled, INT_REQ2 remains low. The interrupt request is
 * cleared by writing a 1 to STS2. IEN2 and DEN2 should not both be set to 1.
 *
 * Values:
 * - 0 - Interrupt disabled
 * - 1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_IEN2 field. */
#define XBARA_RD_CTRL1_IEN2(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_IEN2_MASK) >> XBARA_CTRL1_IEN2_SHIFT)
#define XBARA_BRD_CTRL1_IEN2(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_IEN2_SHIFT))

/*! @brief Set the IEN2 field to a new value. */
#define XBARA_WR_CTRL1_IEN2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_IEN2_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_IEN2(value)))
#define XBARA_BWR_CTRL1_IEN2(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_IEN2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field EDGE2[3:2] (RW)
 *
 * This field selects which edges on XBAR_OUT2 cause STS2 to assert.
 *
 * Values:
 * - 00 - STS2 never asserts
 * - 01 - STS2 asserts on rising edges of XBAR_OUT2
 * - 10 - STS2 asserts on falling edges of XBAR_OUT2
 * - 11 - STS2 asserts on rising and falling edges of XBAR_OUT2
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_EDGE2 field. */
#define XBARA_RD_CTRL1_EDGE2(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_EDGE2_MASK) >> XBARA_CTRL1_EDGE2_SHIFT)
#define XBARA_BRD_CTRL1_EDGE2(base) (XBARA_RD_CTRL1_EDGE2(base))

/*! @brief Set the EDGE2 field to a new value. */
#define XBARA_WR_CTRL1_EDGE2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_EDGE2_MASK | XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_EDGE2(value)))
#define XBARA_BWR_CTRL1_EDGE2(base, value) (XBARA_WR_CTRL1_EDGE2(base, value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field STS2[4] (W1C)
 *
 * This bit reflects the results of edge detection for XBAR_OUT2. This field is
 * set to 1 when an edge consistent with the current setting of EDGE2 is detected
 * on XBAR_OUT2. This field is cleared by writing 1 to it or by a DMA_ACK2
 * reception when DEN2 is set. Writing 0 to the field has no effect. When interrupt or
 * DMA functionality is enabled for XBAR_OUT2, this field is 1 when the
 * interrupt or DMA request is asserted and 0 when the interrupt or DMA request has been
 * cleared.
 *
 * Values:
 * - 0 - Active edge not yet detected on XBAR_OUT2
 * - 1 - Active edge detected on XBAR_OUT2
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_STS2 field. */
#define XBARA_RD_CTRL1_STS2(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_STS2_MASK) >> XBARA_CTRL1_STS2_SHIFT)
#define XBARA_BRD_CTRL1_STS2(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS2_SHIFT))

/*! @brief Set the STS2 field to a new value. */
#define XBARA_WR_CTRL1_STS2(base, value) (XBARA_RMW_CTRL1(base, (XBARA_CTRL1_STS2_MASK | XBARA_CTRL1_STS3_MASK), XBARA_CTRL1_STS2(value)))
#define XBARA_BWR_CTRL1_STS2(base, value) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_STS2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register XBARA_CTRL1, field DEN3[8] (RW)
 *
 * This bit enables the DMA function on the corresponding XBAR_OUT3 output. When
 * enabled, DMA_REQ3 presents the value STS3. When disabled, the DMA_REQ3 output
 * remains low. IEN3 and DEN3 should not both be set to 1.
 *
 * Values:
 * - 0 - DMA disabled
 * - 1 - DMA enabled
 */
/*@{*/
/*! @brief Read current value of the XBARA_CTRL1_DEN3 field. */
#define XBARA_RD_CTRL1_DEN3(base) ((XBARA_CTRL1_REG(base) & XBARA_CTRL1_DEN3_MASK) >> XBARA_CTRL1_DEN3_SHIFT)
#define XBARA_BRD_CTRL1_DEN3(base) (BITBAND_ACCESS16(&XBARA_CTRL1_REG(base), XBARA_CTRL1_DEN3_SHIFT))

